**Free
Dcl-Pr APLLIBD2 ExtPgm('APLLIBD2');
  pmr1LibNme Like(APLDCT.LibNme);
  pmrOption Like(APLDCT.Option);
  pmrKeyPressed Like(keyPressed);
End-Pr;
