**Free
Dcl-Pr APLLIBBP ExtPgm;
  pmrLibNme Like(APLDCT.libNme) Options(*nopass);
  pmrDes Like(APLDCT.Des) Options(*nopass);
  pmrKeyPressed Like(keyPressed) Options(*nopass);
End-Pr;
