**Free
Dcl-Pr APLLIBD1 ExtPgm('APLLIBD1');
  pmrLibNme Like(APLDCT.LibNme);
  pmrOption Like(APLDCT.Option) Const;
  pmrKeyPressed Like(keyPressed);
  pmrSchVal like(APLDCT.schVal) options(*nopass);
End-Pr;
