**Free
Dcl-Pr APLLIBB0 ExtPgm('APLLIBB0');
  pmrLibNme Like(APLDCT.LibNme);
  pmrSel Like(APLDCT.Option) Const;
  pmrKeyPressed Like(keyPressed);
End-Pr;
