**Free
Dcl-Pr AUDLOGB0 ExtPgm('AUDLOGB0');
  pmrFleLib Like(APLDCT.FleLib);
  pmrFleNme Like(APLDCT.FleNme);
  pmrFldNme Like(APLDCT.FldNme);
  pmrAudLogIdn Like(APLDCT.AudLogIdn) const;
  pmrSel Like(APLDCT.Option) Const;
  pmrKeyPressed Like(keyPressed);
End-Pr;
