**Free
Dcl-Pr AUDLOGD2 ExtPgm('AUDLOGD2');
  pmr1FleLib Like(APLDCT.FleLib);
  pmr1FleNme Like(APLDCT.FleNme);
  pmr1FldNme Like(APLDCT.FldNme);
  pmr1AudLogIdn Like(APLDCT.audLogIdn) const;
  pmrOption Like(APLDCT.Option);
  pmrKeyPressed Like(keyPressed);
End-Pr;
