**FREE
Ctl-Opt Option(*SrcStmt) DftActGrp(*No) ActGrp(*New) Main(Main);

// Build APLLIB - Initial File Seeds

// This member creates all files for the dta system and seeds the with some required data
// the intent is to allow the dictionary and file system to be moved to a new library and
// started from scratch.

// For testing the system has been move the library APLLIB. This member hard references
// that library, change it to where you want this to run.

// create the dictionary, fields and segments files

// default SQL options, rarely do any of these change
Exec SQL Set Option Commit = *none, UsrPrf = *owner, datfmt = *ISO, DynUsrPrf = *owner, CloSQLCsr = *endmod,
                    SrtSeq = *langidshr;

Dcl-Proc Main;

  // Build DCTMST
  Exec SQL
    Create or Replace Table APLLIB/DCTMST (
        active_row for Column AcvRow Char(1) not null with default '1',
        dictionary_master_id for Column dctMstIdn bigInt
            not null generated always as identity (start with 1 increment by 1),
        dictionary_name for Column dctNme char(10) not null with default,
        description for Column des char(40) not null with default,
        note_ for Column nte char(60) not null with default,
        creation_time_stamp for Column crtDtm timestamp not null with default current timestamp,
        creation_user for Column crtUsr char(18) not null with default user,
        creation_job for Column crtJob char(28) not null with default,
        creation_program for Column crtPgm char(10) not null with default,
        maintenance_time_stamp for Column mntDtm timeStamp not null with default current timestamp,
        maintenance_user for Column mntUsr char(18) not null with default user,
        maintenance_job for Column mntJob char(28) not null with default,
        maintenance_program for Column MntPgm char(10) not null with default
        )
      RcdFmt DCTmstR;

  Exec SQL Alter Table APLLIB.DCTMST add Constraint APLLIB.DCTMST Primary Key( DctNme );

  Exec SQL Label on Table APLLIB/DCTMST is 'Dictionary Master File';

  Exec SQL
    Label on Column APLLIB.DCTMST
    (ACTIVE_ROW is 'Active              Row' ,
      DICTIonARY_MASTER_ID is 'Dictionary          Master              Id' ,
      DICTIonARY_NAME is 'Dictionary          Name' ,
      DESCRIPTIon is 'Description' ,
      NOTE_ is 'Note' ,
      CREATIon_TIME_STAMP is 'Creation            Date' ,
      CREATIon_USER is 'Creation            User' ,
      CREATIon_JOB is 'Creation            Job' ,
      CREATIon_PROGRAM is 'Creation            Program' ,
      MAINTENANCE_TIME_STAMP is 'Maintenance         Date' ,
      MAINTENANCE_USER is 'Maintenance         User' ,
      MAINTENANCE_JOB is 'Maintenance         Job' ,
      MAINTENANCE_PROGRAM is 'Maintenance         Program' ) ;

  Exec SQL
    Label on Column APLLIB.DCTMST
    (ACTIVE_ROW TEXT is 'Active Row' ,
      DICTIonARY_MASTER_ID TEXT is 'Dictionary Master ID' ,
      DICTIonARY_NAME TEXT is 'Dictionary Name' ,
      DESCRIPTIon TEXT is 'Description' ,
      NOTE_ TEXT is 'Note' ,
      CREATIon_TIME_STAMP TEXT is 'Creation Date' ,
      CREATIon_USER TEXT is 'Creation User' ,
      CREATIon_JOB TEXT is 'Creation Job' ,
      CREATIon_PROGRAM TEXT is 'Creation Program' ,
      MAINTENANCE_TIME_STAMP TEXT is 'Maintenance Date' ,
      MAINTENANCE_USER TEXT is 'Maintenance User' ,
      MAINTENANCE_JOB TEXT is 'Maintenance Job' ,
      MAINTENANCE_PROGRAM TEXT is 'Maintenance Program' ) ;

  // Build DCTFLD file
  Exec SQL
    Create or Replace Table APLLIB/DCTFLD
      (
        active_row for Column AcvRow Char(1) not null with default '1',
        dictionary_field_id for Column dctFldIdn bigInt
            not null generated always as identity (start with 1 increment by 1),
        dictionary_name for Column dctNme char(10) not null with default,
        field_name for Column fldNme char(10) not null with default,
        field_name_sql for Column fldNmeSql char(30) not null with default,
        description for Column des char(40) not null with default,
        field_type for Column fldTyp char(14) not null with default,
        field_length for Column fldLen decimal(50) not null with default,
        field_scale for Column fldScl decimal(2) not null with default,
        field_allocation for Column fldAlc decimal(50) not null with default,
        project_number for Column prjNbr char(10) not null with default,
        Column_text for Column colTxt char(50) not null with default,
        Column_heading for Column colHdg char(60) not null with default,
        processed_flag for Column pcdFlg char(1) not null with default,
        field_prompt_text for Column fldPmp char(20) not null with default,
        allow_null for Column alwNul char(1) not null with default,
        default_value for Column dftVal char(60) not null with default,
        field_enumerated for Column fldEnm char(1) not null with default,
        creation_time_stamp for Column crtDtm timestamp not null with default current timestamp,
        creation_user for Column crtUsr char(18) not null with default user,
        creation_job for Column crtJob char(28) not null with default,
        creation_program for Column crtPgm char(10) not null with default,
        maintenance_time_stamp for Column mntDtm timeStamp not null with default current timestamp,
        maintenance_user for Column mntUsr char(18) not null with default user,
        maintenance_job for Column mntJob char(28) not null with default,
        maintenance_program for Column MntPgm char(10) not null with default
      )
      RcdFmt DCTFLDR;
  Exec SQL Alter Table APLLIB.DCTFLD add Constraint APLLIB.DCTFLD Primary Key( DctNme, fldNme );

  Exec SQL Label on Table APLLIB/DCTFLD is 'Dictionary Field File';

  Exec SQL
    Label on Column APLLIB.DCTFLD
    (ACTIVE_ROW is 'Active              Row' ,
      DICTIonARY_FIELD_ID is 'Dictionary          Field               Id' ,
      DICTIonARY_NAME is 'Dictionary          Name' ,
      FIELD_NAME is 'Field               Name' ,
      FIELD_NAME_SQL is 'Field               Name                SQL' ,
      FLDTYP is 'Field               Type' ,
      FIELD_LENGTH is 'Field               Length' ,
      FLDSCL is 'Field               Scale' ,
      FIELD_ALLOCATIon is 'Field               Allocation' ,
      PRJNBR is 'Project             Number' ,
      COLTXT is 'Column              Text' ,
      COLHDG is 'Column              Heading' ,
      PCDFLG is 'Processed           Flag' ,
      FLDPMP is 'Field               Prompt              TEXT' ,
      ALWNUL is 'Allow               Null' ,
      DFTVAL is 'Default             Value' ,
      FIELD_ENUMERATED is 'Field               Enumerated' ,
      CRTDTM is 'Creation            Date' ,
      CRTUSR is 'Creation            User' ,
      CRTJOB is 'Creation            Job' ,
      CRTPGM is 'Creation            Program' ,
      MNTDTM is 'Maintenance         Date' ,
      MNTUSR is 'Maintenance         User' ,
      MNTJOB is 'Maintenance         Job' ,
      MNTPGM is 'Maintenance         Program' ) ;

  Exec SQL
    Label on Column APLLIB.DCTFLD
    (ACTIVE_ROW TEXT is 'Active Row' ,
      DICTIonARY_FIELD_ID TEXT is 'Dictionary Field ID' ,
      DICTIonARY_NAME TEXT is 'Dictionary Name' ,
      FIELD_NAME TEXT is 'Field Name' ,
      FIELD_NAME_SQL TEXT is 'Field Name SQL (long name)' ,
      FLDTYP TEXT is 'Field' ,
      FIELD_LENGTH TEXT is 'Field Length' ,
      FLDSCL TEXT is 'Field Scale' ,
      FIELD_ALLOCATIon TEXT is 'Field Allocation' ,
      PRJNBR TEXT is 'Project Number' ,
      COLTXT TEXT is 'Column Text' ,
      COLHDG TEXT is 'Column Heading' ,
      PCDFLG TEXT is 'Processed Flag' ,
      FLDPMP TEXT is 'Field Prompt Text' ,
      ALWNUL TEXT is 'Allow Null' ,
      DFTVAL TEXT is 'Default Value' ,
      FIELD_ENUMERATED TEXT is 'Field Enumerated' ,
      CRTDTM TEXT is 'Creation Date' ,
      CRTUSR TEXT is 'Creation User' ,
      CRTJOB TEXT is 'Creation Job' ,
      CRTPGM TEXT is 'Creation Program' ,
      MNTDTM TEXT is 'Maintenance Date' ,
      MNTUSR TEXT is 'Maintenance User' ,
      MNTJOB TEXT is 'Maintenance Job' ,
      MNTPGM TEXT is 'Maintenance Program' ) ;

  // Build DCTSEG file
  Exec SQL
    Create or Replace Table APLLIB/DCTSEG (
        active_row for Column AcvRow Char(1) not null with default '1',
        dictionary_segment_id for Column dctSegIdn bigInt
            not null generated always as identity (start with 1 increment by 1),
        data_segment for Column dtaSeg char(3) not null with default,
        description for Column des char(40) not null with default,
        Column_text for Column colTxt char(50) not null with default,
        Column_heading_for_a_segment for Column colHdgSeg char(20) not null with default,
        conflicts_exist for Column cnfExs char(60) not null with default,
        note_ for Column nte char(60) not null with default,
        creation_time_stamp for Column crtDtm timestamp not null with default current timestamp,
        creation_user for Column crtUsr char(18) not null with default user,
        creation_job for Column crtJob char(28) not null with default,
        creation_program for Column crtPgm char(10) not null with default,
        maintenance_time_stamp for Column mntDtm timeStamp not null with default current timestamp,
        maintenance_user for Column mntUsr char(18) not null with default user,
        maintenance_job for Column mntJob char(28) not null with default,
        maintenance_program for Column MntPgm char(10) not null with default
        )
      RcdFmt DCTSEGR;
  Exec SQL Alter Table APLLIB.DCTSEG add Constraint APLLIB.DCTSEG Primary Key( dtaSeg );
  Exec SQL Label on Table APLLIB/DCTSEG is 'Dictionary Field Name Segment File';

  Exec SQL
    Label on Column APLLIB.DCTSEG
    (ACTIVE_ROW                    is 'Active              Row' ,
      DICTIonARY_SEGMENT_ID        is 'Dictionary          Segment             Id' ,
      DATA_SEGMENT                 is 'Data                Segment' ,
      DESCRIPTIon                  is 'Description' ,
      Column_TEXT                  is 'Column              Text' ,
      Column_HEADING_FOR_A_SEGMENT is 'Column              Heading             For Segment' ,
      Conflicts_Exist              is 'Conflicts           Exists' ,
      NOTE_                        is 'Note' ,
      CREATIon_TIME_STAMP          is 'Creation            Date' ,
      CREATIon_USER                is 'Creation            User' ,
      CREATIon_JOB                 is 'Creation            Job' ,
      CREATIon_PROGRAM             is 'Creation            Program' ,
      MAINTENANCE_TIME_STAMP       is 'Maintenance         Date' ,
      MAINTENANCE_USER             is 'Maintenance         User' ,
      MAINTENANCE_JOB              is 'Maintenance         Job' ,
      MAINTENANCE_PROGRAM          is 'Maintenance         Program' );

  Exec SQL
    Label on Column APLLIB.DCTSEG
    (ACTIVE_ROW TEXT is 'Active Row' ,
      DICTIonARY_SEGMENT_ID TEXT is 'Dictionary Segment ID' ,
      DATA_SEGMENT TEXT is 'Data Segment' ,
      DESCRIPTIon TEXT is 'Description' ,
      Column_TEXT TEXT is 'Column Text' ,
      Column_HEADING_FOR_A_SEGMENT TEXT is 'Column Heading for a Segment' ,
      Conflicts_Exist TEXT is 'Confirm Exists' ,
      NOTE_ TEXT is 'Note' ,
      CREATIon_TIME_STAMP TEXT is 'Creation Date' ,
      CREATIon_USER TEXT is 'Creation User' ,
      CREATIon_JOB TEXT is 'Creation Job' ,
      CREATIon_PROGRAM TEXT is 'Creation Program' ,
      MAINTENANCE_TIME_STAMP TEXT is 'Maintenance Date' ,
      MAINTENANCE_USER TEXT is 'Maintenance User' ,
      MAINTENANCE_JOB TEXT is 'Maintenance Job' ,
      MAINTENANCE_PROGRAM TEXT is 'Maintenance Program' );


  // Build FLDTYP file, Field Types
  // call qsys2.generate_sql('FLDTYP','DTLLIB','TABLE','QSRC','TOGLIB','FLETYP', replace_option => 1) */
  Exec SQL
    Create or Replace Table APLLIB.FLDTYP
      (
        active_row for Column ACVROW CHAR(1) not null default '1' ,
        FIELD_TYPE_ID for Column FLDTYPIDN  BIGINT generated always as identity (start with 1 increment BY 1),
        field_ for Column FLDTYP CHAR(14) not null default '' ,
        description for Column DES CHAR(40) not null default '' ,
        is_numeric for Column NMR CHAR(2) not null default '' ,
        allow_decimal_positions for Column ALWDEC CHAR(1) not null default '' ,
        allow_length for Column ALWLEN CHAR(1) not null default '' ,
        require_length for Column REQLEN CHAR(1) not null default '' ,
        allow_allocation for Column ALWALC CHAR(1) not null default '' ,
        require_allocation for Column REQALC CHAR(1) not null default '' ,
        maximum_length for Column MAXLEN BIGINT not null default 0 ,
        largest_value for Column LRGVAL DECIMAL(63, 0) not null default 0 ,
        smallest_value for Column SMLVAL DECIMAL(63, 0) not null default 0 ,
        force_length for Column FRCLEN CHAR(1) not null default '' ,
        force_length_1 for Column FRCLEN1 INTEGER not null default 0 ,
        force_length_2 for Column FRCLEN2 INTEGER not null default 0 ,
        force_length_3 for Column FRCLEN3 INTEGER not null default 0 ,
        force_length_4 for Column FRCLEN4 INTEGER not null default 0 ,
        force_length_5 for Column FRCLEN5 INTEGER not null default 0 ,
        DEFAULT_VALUE for Column DFTVAL CHAR(60) not null default '' ,
        SYSTEM_TYPE for Column SYSTYP CHAR(10) not null default '' ,
        SYSTEM_LENGTH for Column SYSLEN DECIMAL(20, 0) not null default 0 ,
        creation_time_stamp for Column crtDtm timestamp not null with default current timestamp,
        creation_user for Column crtUsr char(18) not null with default user,
        creation_job for Column crtJob char(28) not null with default,
        creation_program for Column crtPgm char(10) not null with default,
        maintenance_time_stamp for Column mntDtm timeStamp not null with default current timestamp,
        maintenance_user for Column mntUsr char(18) not null with default user,
        maintenance_job for Column mntJob char(28) not null with default,
        maintenance_program for Column MntPgm char(10) not null with default
      )
      RCDFMT FLDTYPR;
  Exec SQL Alter Table APLLIB.FLDTYP add Constraint APLLIB.FLDTYP Primary Key( fldTyp );

  Exec SQL Label on TABLE APLLIB.FLDTYP is 'Dictionary Field Type' ;

  Exec SQL
    Label on Column APLLIB.FLDTYP
    (ACVROW is 'Active              Row' ,
      FIELD_TYPE_ID is 'Field               Type                Id' ,
      FLDTYP is 'Field               Type' ,
      DES is 'Description' ,
      NMR is 'Numeric' ,
      ALWDEC is 'Allow1              Decimal             Positions' ,
      ALWLEN is 'Allow               Length' ,
      REQLEN is 'Require Length' ,
      ALWALC is 'Allow               Allocation' ,
      REQALC is 'Require             Allocation' ,
      MAXLEN is 'Maximum             Length' ,
      LRGVAL is 'Largest             Value' ,
      SMLVAL is 'Smallest            Value' ,
      FRCLEN is 'Force               Length' ,
      FRCLEN1 is 'Force               Length 1' ,
      FRCLEN2 is 'Force               Length 2' ,
      FRCLEN3 is 'Force               Length 3' ,
      FRCLEN4 is 'Force               Length 4' ,
      FRCLEN5 is 'Force               Length 5' ,
      DEFAULT_VALUE is 'Default             Value' ,
      SYSTEM_TYPE is 'System              Type' ,
      SYSTEM_LENGTH is 'System              Length' ,
      CRTDTM is 'Creation            Date' ,
      CRTUSR is 'Creation            User' ,
      CRTJOB is 'Creation            Job' ,
      CRTPGM is 'Creation            Program' ,
      MNTDTM is 'Maintenance         Date' ,
      MNTUSR is 'Maintenance         User' ,
      MNTJOB is 'Maintenance         Job' ,
      MNTPGM is 'Maintenance         Program' ) ;

  Exec SQL
    Label on Column APLLIB.FLDTYP
    (ACVROW TEXT is 'Active Row' ,
      FIELD_TYPE_ID TEXT is 'Field Type ID' ,
      FLDTYP TEXT is 'Field' ,
      DES TEXT is 'Description' ,
      NMR TEXT is 'is Numeric' ,
      ALWDEC TEXT is 'Allow Decimal Positions' ,
      ALWLEN TEXT is 'Allow Length' ,
      REQLEN TEXT is 'Require Length' ,
      ALWALC TEXT is 'Allow Allocation' ,
      REQALC TEXT is 'Require Allocation' ,
      MAXLEN TEXT is 'Maximum Lenght' ,
      LRGVAL TEXT is 'Largest Value' ,
      SMLVAL TEXT is 'Smallest Value' ,
      FRCLEN TEXT is 'Force Length' ,
      FRCLEN1 TEXT is 'Force Length 1' ,
      FRCLEN2 TEXT is 'Force Length 2' ,
      FRCLEN3 TEXT is 'Force Length 3' ,
      FRCLEN4 TEXT is 'Force Length 4' ,
      FRCLEN5 TEXT is 'Force Length 5' ,
      DEFAULT_VALUE TEXT is 'Default Value' ,
      SYSTEM_TYPE TEXT is 'System Type' ,
      SYSTEM_LENGTH TEXT is 'System Length' ,
      CRTDTM TEXT is 'Creation Date' ,
      CRTUSR TEXT is 'Creation User' ,
      CRTJOB TEXT is 'Creation Job' ,
      CRTPGM TEXT is 'Creation Program' ,
      MNTDTM TEXT is 'Maintenance Date' ,
      MNTUSR TEXT is 'Maintenance User' ,
      MNTJOB TEXT is 'Maintenance Job' ,
      MNTPGM TEXT is 'Maintenance Program' ) ;

  // Build DCTVAL File
  Exec SQL
    Create or Replace Table APLLIB.DCTVAL
      (
        actvie_row for Column ACVROW CHAR(1) not null DEFAULT '1' ,
        DICTIonARY_VALUE_ID FOR Column DCTVALIDN  BIGINT
          generated always as identity (start with 1 increment BY 1),
        dictionary_name for Column DCTNME CHAR(10) CCSID 37 not null with DEFAULT,
        field_name for Column FLDNME CHAR(10) not null with DEFAULT,
        enumerated_value for Column ENMVAL CHAR(10) not null with DEFAULT,
        enumerated_description for Column ENMDES CHAR(40) not null with DEFAULT,
        creation_time_stamp for Column crtDtm timestamp not null with default current timestamp,
        creation_user for Column crtUsr char(18) not null with default user,
        creation_job for Column crtJob char(28) not null with default,
        creation_program for Column crtPgm char(10) not null with default,
        maintenance_time_stamp for Column mntDtm timeStamp not null with default current timestamp,
        maintenance_user for Column mntUsr char(18) not null with default user,
        maintenance_job for Column mntJob char(28) not null with default,
        maintenance_program for Column MntPgm char(10) not null with default
      )
      RCDFMT DCTVALR;
  Exec SQL Alter Table APLLIB.DCTVAL add Constraint APLLIB.DCTVAL Primary Key( DctNme, fldNme, enmVal );

  Exec SQL Label on Table APLLIB.DCTVAL is 'Dictionary Field Enumerated Values' ;

  Exec SQL
    Label on Column APLLIB.DCTVAL
    (ACVROW is 'Active              Row' ,
      DICTIonARY_VALUE_ID is 'Dictionary          Value               Id' ,
      DCTNME is 'Dictionary          Name' ,
      FLDNME is 'Field               Name' ,
      ENMVAL is 'Enumerated          Value' ,
      ENMDES is 'Enumerated          Description' ,
      CRTDTM is 'Creation            Date' ,
      CRTUSR is 'Creation            User' ,
      CRTJOB is 'Creation            Job' ,
      CRTPGM is 'Creation            Program' ,
      MNTDTM is 'Maintenance         Date' ,
      MNTUSR is 'Maintenance         User' ,
      MNTJOB is 'Maintenance         Job' ,
      MNTPGM is 'Maintenance         Program');

  Exec SQL
    Label on Column APLLIB.DCTVAL
    (ACVROW TEXT is 'Active Row' ,
      DCTVALIDN TEXT is 'Dictionary Value Id' ,
      DCTNME TEXT is 'Dictionary Name' ,
      FLDNME TEXT is 'Field Name' ,
      ENMVAL TEXT is 'Enumerated Value' ,
      ENMDES TEXT is 'Enumerated Description' ,
      CRTDTM TEXT is 'Creation Date' ,
      CRTUSR TEXT is 'Creation User' ,
      CRTJOB TEXT is 'Creation Job' ,
      CRTPGM TEXT is 'Creation Program' ,
      MNTDTM TEXT is 'Maintenance Date' ,
      MNTUSR TEXT is 'Maintenance User' ,
      MNTJOB TEXT is 'Maintenance Job' ,
      MNTPGM TEXT is 'Maintenance Program');

  // populate field types */
  Exec SQL Truncate APLLIB.FLDTYP;
  Exec SQL Alter Table APLLIB.FLDTYP Alter Column fldTypIdn Restart With 1;
  Exec SQL
  Insert into APLLIB.FLDTYP
        (ACVROW,FLDTYP,      DES,                               NMR,ALWDEC,ALWLEN,REQLEN,ALWALC,REQALC,MAXLEN,
        LRGVAL,SMLVAL,FRCLEN,FRCLEN1,FRCLEN2,FRCLEN3,FRCLEN4,FRCLEN5,DEFAULT_VALUE,SYSTEM_TYPE,SYSTEM_LENGTH)
  values(1,'CHAR      ','Character Field                      ','N','N','Y','Y','N','N',32766,
        0,0,                   'N',0,0,0,0,0,''' '''                      ,'CHAR    ',0),
        (1,'INTEGER   ','Integer                              ','Y','N','N','N','N','N',0    ,
        2147483648,-2147483648,'N',0,0,0,0,0,0                            ,'INTEGER' ,4),
        (1,'SMALLINT  ','Small Integer                        ','Y','N','N','N','N','N',0    ,
        32768,-32768,          'N',0,0,0,0,0,0                            ,'SMALLINT',2),
        (1,'BIGINT    ','Big Integer                          ','Y','N','N','N','N','N',0,
        9223372036854775808,-9223372036854775808,'N',0,0,0,0,0,0              ,'BIGINT  ',8),
        (1,'DECFLOAT  ','Decimal Floating Point               ','Y','N','Y','Y','N','N',34   ,
        0,0,                   'Y',16,34,0,0,0,'0E0'                      ,'DECFLOAT',0),
        (1,'NUMERIC   ','Zoned Numeric                        ','Y','Y','Y','Y','N','N',63   ,
        0,0,                   'N',0,0,0,0,0,0                            ,'NUMERIC ',0),
        (1,'DECIMAL   ','Packed Decimal                       ','Y','Y','Y','Y','N','N',63   ,
        0,0,                   'N',0,0,0,0,0,0                            ,'DECIMAL ',0),
        (1,'REAL      ','Real (Floating Point Number)         ','Y','N','N','N','N','N',0    ,
        0,0,                   'N',0,0,0,0,0,0                            ,'FLOAT   ',4),
        (1,'DOUBLE    ','Double Precision (Big Floating Point)','Y','N','N','N','N','N',0    ,
        0,0,                   'N',0,0,0,0,0,0                            ,'FLOAT   ',8),
        (1,'VARCHAR   ','Varying Length Character Data        ','N','N','Y','Y','Y','Y',32740,
        0,0,                   'N',0,0,0,0,0,''''''                       ,'VARCHAR ',0),
        (1,'CLOB      ','Character Large Object               ','N','N','Y','Y','N','N',2147483647,
        0,0,              'N',0,0,0,0,0,''''''                       ,'CLOB    ',0),
        (1,'DATE      ','Date                                 ','N','N','N','N','N','N',0    ,
        0,0,                   'N',0,0,0,0,0,'CURRENT_DATE'               ,'DATE    ',4),
        (1,'TIME      ','Time                                 ','N','N','N','N','N','N',0    ,
        0,0,                   'N',0,0,0,0,0,'CURRENT_TIME'               ,'TIME    ',3),
        (1,'TIMESTAMP ','Time Stamp                           ','N','N','N','N','N','N',0    ,
        0,0,                   'N',0,0,0,0,0,'CURRENT_TIMESTAMP'          ,'TIMESTMP',10),
        (1,'BINARY    ','Binary Data                          ','N','N','Y','Y','N','N',255  ,
        0,0,                   'N',0,0,0,0,0,'BINARY(X''00'')'            ,'BINARY  ',0),
        (1,'VARBINARY ','Varying Length Binary Data           ','N','N','Y','Y','Y','Y',32740,
        0,0,                   'N',0,0,0,0,0,'VARBINARY(X'''''')'         ,'VARBIN  ',0),
        (1,'GRAPHIC   ','Graphic Data                         ','N','N','Y','Y','N','N',16383,
        0,0,                   'N',0,0,0,0,0,'N'''''                      ,'GRAPHIC ',0),
        (1,'VARGRAPHIC','Varying Length Graphic Data          ','N','N','Y','Y','Y','Y',16370,
        0,0,                   'N',0,0,0,0,0,'N'''''                      ,'VARG    ',0),
        (1,'BLOB      ','Binary Large Object                  ','N','N','Y','Y','N','N',2147483647,
        0,0,              'N',0,0,0,0,0,'BLOB('''')'                 ,'BLOB    ',0),
        (1,'DBCLOB    ','Large Graphic Object                 ','N','N','Y','Y','N','N',1073741823,
        0,0,              'N',0,0,0,0,0,'N'''''                      ,'DBCLOB  ',0),
        (1,'DATALINK  ','Data Link                            ','N','N','Y','Y','N','N',200  ,
        0,0,                   'N',0,0,0,0,0,'DLVALUE('''',''URL '','''')','DATALINK',0),
        (1,'XML       ','XML Document                         ','N','N','N','N','N','N',0    ,
        0,0,                   'N',0,0,0,0,0,''''''                       ,'XML     ',2147483647),
        (1,'IDENTITY  ','Auto Generated Identity Column       ','Y','N','N','N','N','N',0,
        9223372036854775808,-9223372036854775808,'N',0,0,0,0,0,''''''     ,'BIGINT  ',8);

  // populate DCTMST */
  Exec SQL
    insert into APLLIB.DCTMST
          ( dctNme,  des,                                 nte)
    values('APLDCT','Application Development Dictionary','Application Development Dictionary'),
          ('ERPDCT','ERP Dictionary','This is a dictionary for ERP stuff, outside of APLLIB');

  // populate required segments */
  Exec SQL Truncate APLLIB.DCTSEG;
  Exec SQL Alter Table APLLIB.DCTSEG Alter Column dctSegIdn Restart With 1;
  Exec SQL
Insert into APLLIB.DCTSEG (dtaSeg, des, colTxt, colHdgSeg, cnfExs, nte)
Values('1',  '1                                  ','1                                  ','1                   ',' ',''),
      ('2',  '2                                  ','2                                  ','2                   ',' ',''),
      ('3',  '3                                  ','3                                  ','3                   ',' ',''),
      ('4',  '4                                  ','4                                  ','4                   ',' ',''),
      ('5',  '5                                  ','5                                  ','5                   ',' ',''),
      ('6',  '6                                  ','6                                  ','6                   ',' ',''),
      ('7',  '7                                  ','7                                  ','7                   ',' ',''),
      ('8',  '8                                  ','8                                  ','8                   ',' ',''),
      ('9',  '9                                  ','9                                  ','9                   ',' ',''),
      ('AAR','Auto Archive                       ','Auto Archive                       ','Auto Archive        ',' ',''),
      ('ABC','ABC - Inventory Classification Code','ABC - Inventory Classification Code','ABC - Inventory Clas',' ',''),
      ('ACG','Accounting                         ','Accounting                         ','Accounting          ',' ',''),
      ('ACT','Action                             ','Action                             ','Action              ',' ',''),
      ('ACV','Active                             ','Active                             ','Active              ',' ',''),
      ('ADD','Address                            ','Address                            ','Address             ',' ',''),
      ('AFT','After                              ','After                              ','After               ',' ',''),
      ('ALC','Allocation                         ','Allocation                         ','Allocation          ',' ',''),
      ('ALW','Allow                              ','Allow                              ','Allow               ',' ',''),
      ('APL','Application                        ','Application                        ','Application         ',' ',''),
      ('ARC','Archive                            ','Archive                            ','Archive             ',' ',''),
      ('ATA','Attachment                         ','Attachment                         ','Attachment          ',' ',''),
      ('ATR','Attribute                          ','Attribute                          ','Attribute           ',' ',''),
      ('AUD','Audit                              ','Audit                              ','Audit               ',' ',''),
      ('AUT','Authorization/ Authority           ','Authorization/ Authority           ','Authorization/ Autho',' ',''),
      ('BEG','Begin                              ','Begin                              ','Begin               ',' ',''),
      ('BFR','Before                             ','Before                             ','Before              ',' ',''),
      ('CDE','Code                               ','Code                               ','Code                ',' ',''),
      ('CHG','Change                             ','Change                             ','Change              ',' ',''),
      ('CLN','Clean                              ','Clean                              ','Clean               ',' ',''),
      ('CLS','Class                              ','Class                              ','Class               ',' ',''),
      ('CNF','Conflict/Config                    ','Conflict                           ','Conflict            ','Y',''),
      ('CNT','Count                              ','Count                              ','Count               ',' ',''),
      ('CNY','Contact Type                       ','Contact Type                       ','Contact Type        ',' ',''),
      ('COL','Column/ Collection                 ','Column/ Collection                 ','Column/ Collection  ','Y',''),
      ('CON','Contact                            ','Contact                            ','Contact             ','Y',''),
      ('COU','Country                            ','Country                            ','Country             ','Y',''),
      ('CMP','Company                            ','Company                            ','Company             ',' ',''),
      ('CMT','Comment                            ','Comment                            ','Comment             ',' ',''),
      ('CMT','Comment                            ','Comment                            ','Comment             ',' ',''),
      ('CRT','Create                             ','Create                             ','Create              ',' ',''),
      ('CST','Cost                               ','Cost                               ','Cost                ',' ',''),
      ('CTY','City                               ','City                               ','City                ',' ',''),
      ('DBA','Database Administrator             ','Database Administrator             ','DB Admin            ',' ',''),
      ('DCT','Dictionary                         ','Dictionary                         ','Dictionary          ',' ',''),
      ('DEC','Decimal                            ','Decimal                            ','Decimal             ',' ',''),
      ('DEL','Delete                             ','Delete                             ','Delete              ',' ',''),
      ('DES','Description                        ','Description                        ','Description         ',' ',''),
      ('DEV','Device                             ','Device                             ','Device              ',' ',''),
      ('DFT','Default                            ','Default                            ','Default             ',' ',''),
      ('DPT','Department                         ','Department                         ','Department          ',' ',''),
      ('DSP','Display                            ','Display                            ','Display             ',' ',''),
      ('DTA','Data                               ','Data                               ','Data                ',' ',''),
      ('DVW','Display View                       ','Display View                       ','Display View        ',' ',
       'Used to save the view number on multi-view SFL''s'),
      ('DTE','Date                               ','Date                               ','Date                ',' ',''),
      ('DTL','Detail                             ','Detail                             ','Detail              ',' ',''),
      ('DTM','Date/Time (Time stamp)             ','Date/Time (Time stamp)             ','Date/Time (Time stam',' ',''),
      ('EDT','Edit                               ','Edit                               ','Edit                ',' ',''),
      ('EML','Email                              ','Email                              ','Email               ',' ',''),
      ('EMP','Employee                           ','Employee                           ','Employee            ',' ',''),
      ('END','End/ Ending                        ','End/ Ending                        ','End/ Ending         ',' ',''),
      ('ENM','Enumerated                         ','Enumerated                         ','Enumerated          ',' ',''),
      ('ERR','Error                              ','Error                              ','Error               ',' ',''),
      ('EXS','Exists                             ','Exists                             ','Exists              ',' ',''),
      ('EXT','Extension/ Extended/ Extend        ','Extension/ Extended/ Extend        ','Extension/ Extended/',' ',''),
      ('FAB','Fabricate                          ','Fabricate                          ','Fabricate           ',' ',''),
      ('FAX','Fax                                ','Fax                                ','Fax                 ',' ',''),
      ('FLD','Field                              ','Field                              ','Field               ',' ',''),
      ('FLE','File                               ','File                               ','File                ',' ',''),
      ('FLG','Flag                               ','Flag                               ','Flag                ',' ',''),
      ('FLR','Folder                             ','Folder                             ','Folder              ',' ',''),
      ('FLT','float                              ','float                              ','float               ',' ',''),
      ('FMT','Format                             ','Format                             ','Format              ',' ',''),
      ('FNC','Function                           ','Function                           ','Function            ',' ',''),
      ('FRC','Force                              ','Force                              ','Force               ',' ',''),
      ('FRM','From                               ','From                               ','From                ',' ',''),
      ('FST','First                              ','First                              ','First               ',' ',''),
      ('GPR','Group                              ','Group                              ','Group               ',' ',''),
      ('HDG','Heading                            ','Heading                            ','Heading             ',' ',''),
      ('HGT','Height                             ','Height                             ','Height              ',' ',''),
      ('HLD','Hold                               ','Hold                               ','Hold                ',' ',''),
      ('HLP','Help                               ','Help                               ','Help                ',' ',''),
      ('ICM','increment                          ','increment                          ','increment           ',' ',''),
      ('IDN','Id                                 ','Id                                 ','Id                  ',' ',''),
      ('IDX','Index                              ','Index                              ','Index               ',' ',''),
      ('INC','Include                            ','Include                            ','Include             ',' ',''),
      ('INA','In Address                         ','In Address                         ','In Address          ',' ',''),
      ('INQ','Inquiry                            ','Inquiry                            ','Inquiry             ',' ',''),
      ('INT','Integer/Initials                   ','Integer/Initials                   ','Integer/Initials    ','Y',''),
      ('INV','Invoice                            ','Invoice                            ','Invoice             ',' ',''),
      ('ITR','IT Requester                       ','IT Requester                       ','IT Requester        ',' ',''),
      ('JOB','Job Name                           ','Job Name                           ','Job Name            ',' ',''),
      ('KEY','Key                                ','Key                                ','Key                 ',' ',''),
      ('LEN','Length                             ','Length                             ','Length              ',' ',''),
      ('LIB','Library                            ','Library                            ','Library             ',' ',''),
      ('LNE','Line                               ','Line                               ','Line                ',' ',''),
      ('LOC','Location                           ','Loc                                ','Loc                 ','N',
        'Location'),
      ('LOG','Log                                ','Log                                ','Log                 ',' ',''),
      ('LRG','Large                              ','Large                              ','Large               ',' ',''),
      ('LST','List/Last                          ','List/Last                          ','List/Last           ','Y',''),
      ('LVL','Level                              ','Level                              ','Level               ',' ',''),
      ('MAX','Maximum                            ','Maximum                            ','Maximum             ',' ',''),
      ('MDE','Mode                               ','Mode                               ','Mode                ',' ',''),
      ('MNT','Maintenance                        ','Maintenance                        ','Maintenance         ',' ',''),
      ('MSG','Message                            ','Message                            ','Message             ',' ',''),
      ('MST','Master                             ','Master                             ','Master              ',' ',''),
      ('MNU','Menu                               ','Menu                               ','Menu                ',' ',''),
      ('MSD','Message File Data                  ','Msg Fle Dta                        ','Message File Data   ',' ',''),
      ('MSF','Message File                       ','Message File                       ','Msg File            ',' ',''),
      ('NAT','Native                             ','Native                             ','Native              ',' ',''),
      ('NBR','Number                             ','Number                             ','Number              ',' ',''),
      ('NME','Name                               ','Name                               ','Name                ',' ',''),
      ('NMR','Numeric                            ','Numeric                            ','Numeric             ',' ',''),
      ('NTE','Note                               ','Note                               ','Note                ',' ',''),
      ('NUL','null                               ','null                               ','null                ',' ',''),
      ('OBJ','Object                             ','Object                             ','Object              ',' ',''),
      ('OPT','Option                             ','Option                             ','Option              ',' ',''),
      ('OQN','Output Queue Name                  ','Output Queue Name                  ','Output Queue Name   ',' ',''),
      ('OQL','Output Queue Library               ','Output Queue Library               ','Output Queue Library',' ',''),
      ('OTO','Output Options                     ','Output Options                     ','Output Options      ',' ',''),
      ('OUT','Output                             ','Output                             ','Output              ',' ',''),
      ('OWN','Owner                              ','Owner                              ','Owner               ',' ',''),
      ('PCD','Process/ Processed                 ','Process/ Processed                 ','Process/ Processed  ',' ',''),
      ('PGM','Program                            ','Program                            ','Program             ',' ',''),
      ('PHN','Phone                              ','Phone                              ','Phone               ',' ',''),
      ('PMP','Prompt                             ','Prompt                             ','Prompt              ',' ',''),
      ('PRC','Price                              ','Price                              ','Price               ',' ',''),
      ('PRD','Product                            ','Product                            ','Product             ',' ',''),
      ('PRF','Profile                            ','Profile                            ','Profile             ',' ',''),
      ('PRI','Primary                            ','Primary                            ','Primary             ',' ',''),
      ('PRT','Print                              ','Print                              ','Print               ',' ',''),
      ('PSC','Postal Code                        ','Postal Code                        ','Postal Code         ',' ',''),
      ('PTH','Path                               ','Path                               ','Path                ',' ',''),
      ('PUR','Purchase/Purchasing/Purchased      ','Purchase/Purchasing/Purchased      ','Purchase/Purchasing/',' ',''),
      ('RCD','Record                             ','Record                             ','Record              ',' ',''),
      ('REF','Reference                          ','Reference                          ','Reference           ',' ',''),
      ('ROW','Row                                ','Row                                ','Row                 ',' ',''),
      ('REQ','Requires/Required                  ','Required                           ','Required            ',' ',''),
      ('SAV','Save                               ','Save                               ','Save                ',' ',''),
      ('SCD','Scheduled                          ','Scheduled                          ','Scheduled           ',' ',''),
      ('SCH','Search                             ','Search                             ','Search              ',' ',''),
      ('SCR','Screen                             ','Screen                             ','Screen              ',' ',''),
      ('SEC','Security                           ','Security                           ','Security            ',' ',''),
      ('SEL','Select/Selection                   ','Select/Selection                   ','Select/Selection    ',' ',''),
      ('SEG','Segment                            ','Segment                            ','Segment             ',' ',''),
      ('SEQ','Sequence                           ','Sequence                           ','Sequence            ',' ',''),
      ('SML','Small                              ','Small                              ','Small               ',' ',''),
      ('SQL','Structured Query Language          ','Structured Query Language          ','Structured Query Lan',' ',''),
      ('SRC','Source                             ','Source                             ','Source              ',' ',''),
      ('SRT','Sort                               ','Sort                               ','Sort                ',' ',''),
      ('STA','State                              ','State                              ','State               ',' ',''),
      ('STR','Start                              ','Start                              ','Start               ',' ',''),
      ('STS','Status                             ','Status                             ','Status              ',' ',''),
      ('SYS','System                             ','System                             ','System              ',' ',''),
      ('SZE','Size                               ','Size                               ','Size                ',' ',''),
      ('TBL','Table                              ','Table                              ','Table               ',' ',''),
      ('TOT','Total                              ','Total                              ','Total               ',' ',''),
      ('TRG','Trigger                            ','Trigger                            ','Trigger             ',' ',''),
      ('TST','Test                               ','Test                               ','Test                ',' ',''),
      ('TTL','Title                              ','Title                              ','Title               ',' ',''),
      ('TYP','Type                               ','Type                               ','Type                ',' ',''),
      ('TXT','Text                               ','Text                               ','Text                ',' ',''),
      ('UDF','User Default                       ','User Default                       ','User Default        ',' ',''),
      ('UNI','Unique                             ','Unique                             ','Unique              ',' ',''),
      ('USR','User                               ','User                               ','User                ',' ',''),
      ('UPD','Update                             ','Update                             ','Update              ',' ',''),
      ('VAL','Value                              ','Value                              ','Value               ',' ',''),
      ('VAR','Variable                           ','Variable                           ','Variable            ',' ',''),
      ('VND','Vendor                             ','Vendor                             ','Vendor              ',' ',''),
      ('VRY','Vary/ Varying                      ','Vary/ Varying                      ','Vary/ Varying       ',' ',''),
      ('WEB','Web                                ','Web                                ','Web                 ',' ',''),
      ('WID','Width/ Wide                        ','Width/ Wide                        ','Width/ Wide         ',' ',''),
      ('WRD','Word                               ','Word                               ','Word                ',' ',''),
      ('Zon','Zone                               ','Zone                               ','Zone                ',' ','');

  // populate required dictionary fields */
  Exec SQL Truncate APLLIB.DCTFLD;
  Exec SQL Alter Table APLLIB.DCTFLD Alter Column dctFldIdn Restart With 1;
  Exec SQL
  insert into dctFld
    (dctNme,fldNme,fldNmeSql,fldTyp,fldLen,fldScl,fldAlc,prjNbr,colTxt,colHdg,pcdFlg,fldpmp,alwNul,dftVal,
    fldEnm)
  values('APLDCT','ABCFLEIDN','test_file_id','BIGINT',0,0,0,'','Test file Id',
        'test                file                Id','','','','',''),
  ('APLDCT','ACTCDE','action_code','CHAR',2,0,0,'','Action Code','Action              Code','','','','',''),
  ('APLDCT','ACVDES','active_description','CHAR',8,0,0,'','Active Description','Active              Desc','','','',
    '',''),
  ('APLDCT','ACVROW','active_row','CHAR',1,0,0,'','Active Row','Active              Row','0','','','1','Y'),
  ('APLDCT','AFTVAL','after_value','VARCHAR',100,0,50,'','After Value','After               Value','','','','',''),
  ('APLDCT','ALWALC','allow_allocation','CHAR',1,0,0,'','Allow Allocation','Allow               Allocation','',
  'Allow Allocation','N','','Y'),
  ('APLDCT','ALWDEC','allow_decimal_positions','CHAR',1,0,0,'','Allow Decimal Positions',
  'Allow1              Decimal             Positions','','Allow Dec Positions','N','','Y'),
  ('APLDCT','ALWINQ','allow_inquiry','CHAR',1,0,0,'','Allow Inquiry','Allow                Inquiry','0','','','',''),
  ('APLDCT','ALWLEN','allow_length','CHAR',1,0,0,'','Allow Length','Allow               Length','','Allow Length','N',
  '','Y'),
  ('APLDCT','ALWMNT','allow_maintenance','CHAR',1,0,0,'','Allow Maintenance','Allow               Maintenance','0',
  '','','',''),
  ('APLDCT','ALWNUL','allow_null','CHAR',1,0,0,'','Allow Null','Allow               Null','0','','','',''),
  ('APLDCT','ALWSEL','allow_select','CHAR',1,0,0,'','Allow Select','Allow               Select','0','','','',''),
  ('APLDCT','APL','application','CHAR',3,0,0,'','Application','Application','','','','','Y'),
  ('APLDCT','AUDLOGIDN','file_audit_log_id','BIGINT',0,0,0,'','File Audit Log Id',
  'File                Audit               Log Id','','','','',''),
  ('APLDCT','BEGDTE','beginning_date','DATE',0,0,0,'','Beginning Date','Begin               Date','','','','',''),
  ('APLDCT','BEGDTE8','beginning_date_yyyymmdd','DECIMAL',8,0,0,'','Beginning Date YYYYMMDD',
  'Beginning           Date                YYYYMMDD','','','','',''),
  ('APLDCT','BFRVAL','before_value','VARCHAR',100,0,50,'','Before Value','Before              Value','','','','',''),
  ('APLDCT','CHGSCD','change_scheduled','CHAR',1,0,0,'','Change Scheduled','Change              Scheduled','','',
  '','','Y'),
  ('APLDCT','CLNKEYWRD','clean_key_word','CHAR',20,0,0,'','Clean Key Word',
  'Clean               Key                 Word','','','','',''),
  ('APLDCT','CLNSRCIDN','clean_source_id','BIGINT',0,0,0,'','Clean Source ID',
  'Clean               Source              ID','','','','',''),
  ('APLDCT','CMTEXS','comment_exists','CHAR',1,0,0,'','Comment Exists','Comment             Exists','','','','',''),
  ('APLDCT','CNFEXS','conflicts_exist','CHAR',1,0,0,'','Conflicts Exist','Conflicts            Exist','','','','','Y'),
  ('APLDCT','COLHDG','Column_heading','CHAR',60,0,0,'','Column Heading','Column              Heading','0','','','',''),
  ('APLDCT','COLHDGSEG','Column_heading_for_a_segment','CHAR',20,0,0,'','Column Heading for a Segment',
  'Column              Heading             For Segment','','','','',''),
  ('APLDCT','COLTXT','Column_text','CHAR',50,0,0,'','Column Text','Column              Text','0','','','',''),
  ('APLDCT','CRTDTM','creation_time_stamp','TIMESTAMP',0,0,0,'','Creation Date','Creation            Date','0','',
  '','CURRENT_TIMESTAMP',''),
  ('APLDCT','CRTJOB','creation_job','CHAR',28,0,0,'','Creation Job','Creation            Job','0','','','',''),
  ('APLDCT','CRTNBR','creation_job_number','CHAR',6,0,0,'','Creation Job Number',
  'Creation            Job                 Number','','','','',''),
  ('APLDCT','CRTPGM','creation_program','CHAR',10,0,0,'','Creation Program','Creation            Program','0','',
  '','',''),
  ('APLDCT','CRTUSR','creation_user','CHAR',18,0,0,'','Creation User','Creation            User','0','','','USER',''),
  ('APLDCT','CSTNME','contraint_name','CHAR',30,0,0,'','Contraint Name','Contraint           Name','','','','',''),
  ('APLDCT','CSTTYP','constraint_type','CHAR',11,0,0,'','Constraint Type','Constraint          Type','','','','',''),
  ('APLDCT','DCTFLDIDN','dictionary_field_id','BIGINT',0,0,0,'','Dictionary Field ID',
  'Dictionary          Field               Id','','','','',''),
  ('APLDCT','DCTMSTIDN','dictionary_master_id','BIGINT',0,0,0,'','Dictionary Master ID',
  'Dictionary          Master              Id','','','','',''),
  ('APLDCT','DCTNME','dictionary_name','CHAR',10,0,0,'','Dictionary Name','Dictionary          Name','0','','N','',''),
  ('APLDCT','DCTSEGIDN','dictionary_segment_id','BIGINT',0,0,0,'','Dictionary Segment ID',
  'Dictionary          Segment             Id','','','','',''),
  ('APLDCT','DCTVALIDN','dictionary_value_id','BIGINT',0,0,0,'','Dictionary Value Id',
  'Dictionary          Value               Id','','','','',''),
  ('APLDCT','DES','description','CHAR',40,0,0,'','Description','Description','','Desc','N','',''),
  ('APLDCT','DEVUSR','development_user','CHAR',10,0,0,'','Development User','Development         User','','','','',''),
  ('APLDCT','DFTAUT','default_authorization','CHAR',1,0,0,'','Default Authorization',
  'Default             Authorization','','','','','Y'),
  ('APLDCT','DFTVAL','default_value','CHAR',60,0,0,'','Default Value','Default             Value','0','','','',''),
  ('APLDCT','DSPFLE','display_file','CHAR',10,0,0,'','Display File','Display             File','','','','',''),
  ('APLDCT','DTASEG','data_segment','CHAR',3,0,0,'','Data Segment','Data                Segment','','','N','',''),
  ('APLDCT','DVW','display_view','CHAR',1,0,0,'','Display View','Display             View','','','','1',''),
  ('APLDCT','EDTCDE','edit_code','CHAR',1,0,0,'','Edit Code','Edit                Code','0','','','',''),
  ('APLDCT','EDTWRD','edit_word','CHAR',28,0,0,'','Edit Word','Edit                Word','0','','','',''),
  ('APLDCT','EML','email_','CHAR',50,0,0,'','Email','Email','','Email','','',''),
  ('APLDCT','ENDDTE','ending_date','DATE',0,0,0,'','Ending Date','Ending              Date','','','','',''),
  ('APLDCT','ENDDTE8','ending_date_yyyymmdd','DECIMAL',8,0,0,'','Ending Date YYYYMMDD',
  'Ending              Date                YYYYMMDD','','','','',''),
  ('APLDCT','ENMDES','enumerated_description','CHAR',40,0,0,'','Enumerated Description',
  'Enumerated          Description','0','','N','',''),
  ('APLDCT','ENMVAL','enumerated_value','CHAR',10,0,0,'','Enumerated Value','Enumerated          Value','0','','N','',
   ''),
  ('APLDCT','ERRMSG','error_message','VARCHAR',1000,0,100,'','Error Message','Error               Message','',''
  ,'','',''),
  ('APLDCT','ERRTYP','error_type','CHAR',1,0,0,'','Error Type','Error               Type','','','','',''),
  ('APLDCT','EXTTYP','extended_type','CHAR',10,0,0,'','Extended Type','Extended            Type','','','','',''),
  ('APLDCT','APLLIBIDN','fabric_library_id','BIGINT',0,0,0,'','Fabric Library ID',
  'Fabric              Library             Id','','','','',''),
  ('APLDCT','FLDALC','field_allocation','DECIMAL',5,0,0,'','Field Allocation','Field               Allocation',
  '0','','','',''),
  ('APLDCT','FLDCNT','field_count','DECIMAL',5,0,0,'','Field Count','Field               Count','','','','',''),
  ('APLDCT','FLDCOL','field_Column','DECIMAL',3,0,0,'','Field Column','Field               Column','','','','',''),
  ('APLDCT','FLDENM','field_enumerated','CHAR',1,0,0,'','Field Enumerated','Field               Enumerated','0',
  '','N','','Y'),
  ('APLDCT','FLDIDN','field_id_numbercode','BIGINT',0,0,0,'','Field ID Number/Code',
  'Field               ID                  Number/Code','','','','',''),
  ('APLDCT','FLDLEN','field_length','DECIMAL',5,0,0,'','Field Length','Field               Length','0','','','',''),
  ('APLDCT','FLDLVL','field_level','CHAR',1,0,0,'','Field Level','Field               Level','','','','','Y'),
  ('APLDCT','FLDNME','field_name','CHAR',10,0,0,'','Field Name','Field               Name','0','','','',''),
  ('APLDCT','FLDNMESQL','field_name_sql','CHAR',30,0,0,'','Field Name SQL Version (long name)',
  'Field               Name                SQL','','','','',''),
  ('APLDCT','FLDNTEIDN','field_note_id','BIGINT',0,0,0,'','Field Note Id','Field               Note                Id',
  '','','','',''),
  ('APLDCT','FLDPMP','field_prompt_text','CHAR',20,0,0,'','Field Prompt Text',
  'Field               Prompt              TEXT','0','','','',''),
  ('APLDCT','FLDROW','field_row','DECIMAL',3,0,0,'','Field Row','Field               Row','','','','',''),
  ('APLDCT','FLDSCL','field_scale','DECIMAL',2,0,0,'','Field Scale','Field               Scale','0','','','',''),
  ('APLDCT','FLDSEQ','field_sequence','DECIMAL',7,0,0,'','Field Sequence','Field               Sequence','','','','',
   ''),
  ('APLDCT','FLDSTS','field_status','CHAR',1,0,0,'','Field Status','Field               Status','','','','','Y'),
  ('APLDCT','FLDTYP','field_','CHAR',14,0,0,'','Field','Field               Type','0','','','','Y'),
  ('APLDCT','FLDTYPIDN','field_type_id','BIGINT',0,0,0,'','Field Type ID','Field               Type                Id',
  '','','','',''),
  ('APLDCT','FLE','file_','CHAR',10,0,0,'','File','File','','','','',''),
  ('APLDCT','FLEDES','file_description','CHAR',50,0,0,'','File Description','File                Description','','','',
  '',''),
  ('APLDCT','FLEERR','file_error','CHAR',1,0,0,'','File Error','File                Error','','','','','Y'),
  ('APLDCT','FLEERRIDN','file_errors_id','BIGINT',0,0,0,'','File Errors Id',
   'File                Errors              Id','','','','',''),
  ('APLDCT','FLEFLDIDN','file_field_id','BIGINT',0,0,0,'','File Field ID','File                Field               Id',
  '','','','',''),
  ('APLDCT','FLEIDN','file_idn','BIGINT',0,0,0,'','File IDN','File                IDN','','','','',''),
  ('APLDCT','FLEIDXIDN','file_index_id','BIGINT',0,0,0,'','File Index ID','File                Index               Id',
  '','','','',''),
  ('APLDCT','FLELIB','file_library','CHAR',10,0,0,'','File Library','File                Library','','','','',''),
  ('APLDCT','FLELOGIDN','file_log_id','BIGINT',0,0,0,'','File Log ID','File                Log                 Id','',
  '','','',''),
  ('APLDCT','FLEMSTIDN','file_id','BIGINT',0,0,0,'','File Master ID','File                Master              Id','',
  '','','',''),
  ('APLDCT','FLENME','file_name','CHAR',10,0,0,'','File Name','File                Name','','','','',''),
  ('APLDCT','FLENTEIDN','file_note_id','BIGINT',0,0,0,'','File Note ID Number',
  'File Note           Note                Id','','','','',''),
  ('APLDCT','FLESTS','file_status','CHAR',1,0,0,'','File Status','File                Status','','','','','Y'),
  ('APLDCT','FLETYP','file_type','CHAR',6,0,0,'','File Type','File                Type','','','','',''),
  ('APLDCT','FLT','filter_','VARCHAR',2048,0,256,'','Filter','Filter','0','','N','',''),
  ('APLDCT','FNCDES','function_description','CHAR',50,0,0,'','Function Description',
  'Function            Description','','','','',''),
  ('APLDCT','FNCKEY','function_key','CHAR',10,0,0,'','Function Key','Function            Key','0','','N','',''),
  ('APLDCT','FNCNME','function_name','CHAR',20,0,0,'','Function Name','Function            Name','','','','',''),
  ('APLDCT','FNCTYP','function_type','CHAR',8,0,0,'','Function Type','Function            Type','','','','',''),
  ('APLDCT','FRCLEN','force_length','CHAR',1,0,0,'','Force Length','Force               Length','','','','','Y'),
  ('APLDCT','FRCLEN1','force_length_1','INTEGER',0,0,0,'','Force Length 1','Force               Length 1','','','',
  '',''),
  ('APLDCT','FRCLEN2','force_length_2','INTEGER',0,0,0,'','Force Length 2','Force               Length 2','','','',
  '',''),
  ('APLDCT','FRCLEN3','force_length_3','INTEGER',0,0,0,'','Force Length 3','Force               Length 3','','','',
  '',''),
  ('APLDCT','FRCLEN4','force_length_4','INTEGER',0,0,0,'','Force Length 4','Force               Length 4','','','',
  '',''),
  ('APLDCT','FRCLEN5','force_length_5','INTEGER',0,0,0,'','Force Length 5','Force               Length 5','','','',
  '',''),
  ('APLDCT','FRMLIB','from_library','CHAR',10,0,0,'','From Library','From                Library','','','','',''),
  ('APLDCT','HGT','height_','DECIMAL',5,2,0,'','Height','Height','','','','',''),
  ('APLDCT','HLPCNT','help_count','DECIMAL',6,0,0,'','Help Count','Help                Count','','','','',''),
  ('APLDCT','HLPDTLIDN','help_detail_id','BIGINT',0,0,0,'','Help Detail Id',
   'Help                Detail              Id','','','','',''),
  ('APLDCT','HLPMSTIDN','help_master_id','BIGINT',0,0,0,'','Help Master Id',
   'Help                Master              Id','','','','',''),
  ('APLDCT','HLPREF','help_reference','CHAR',10,0,0,'','Help Reference','Help                Reference','','','','',''),
  ('APLDCT','HLPTXT','help_text','CHAR',79,0,0,'','Help Text','Help                Text','','','N','',''),
  ('APLDCT','HLPTYP','help_type','CHAR',1,0,0,'','Help Type','Help                Type','','','','','Y'),
  ('APLDCT','IDN','unique_row_identifier','IDENTITY',0,0,0,'','Unique Row Identifier',
  'Unique              Row                 Identifier','','','','',''),
  ('APLDCT','IDNICM','id_increment','BIGINT',0,0,0,'','ID increment','ID                  increment','','','','',''),
  ('APLDCT','IDXCNT','index_count','DECIMAL',5,0,0,'','Index Count','Index               Count','','','','',''),
  ('APLDCT','IDXFLD','file_index_field','CHAR',10,0,0,'','File Index Field',
  'File                Index               Field','','','','',''),
  ('APLDCT','IDXFLDIDN','index_field_id','BIGINT',0,0,0,'','Index Field ID',
  'Index               Field               Id','','','','',''),
  ('APLDCT','IDXLIB','index_library','CHAR',10,0,0,'','Index Library','Index               Library','','','','',''),
  ('APLDCT','IDXNME','index_name','CHAR',10,0,0,'','Index Name','Index               Name','','','','',''),
  ('APLDCT','IDXSEQ','index_field_sequence','DECIMAL',7,0,0,'','Index Field Sequence',
  'Index               Field               Sequence','','','','',''),
  ('APLDCT','IDXTXT','index_text','CHAR',50,0,0,'','Index Text','Index               Text','','','','',''),
  ('APLDCT','IDXUNI','index_unique','CHAR',1,0,0,'','Index Unique','Index               Unique','','','','','Y'),
  ('APLDCT','INT','integer_','INTEGER',0,0,0,'','Integer','Integer','','','','',''),
  ('APLDCT','INVLOCIDN','invoice_loc_id','BIGINT',0,0,0,'','Invoice Loc Id',
  'Invoice             Loc                 Id','','','','',''),
  ('APLDCT','KEYWRD','key_word','CHAR',20,0,0,'','Key Word','Key                 Word','','','','',''),
  ('APLDCT','LEN','length_','DECIMAL',5,2,0,'','Length','Length','','','','',''),
  ('APLDCT','LIB','library_','CHAR',10,0,0,'','Library','Library','','','','',''),
  ('APLDCT','LIBDES','library_description','CHAR',50,0,0,'','Library Description',
  'Library             Description','','','','',''),
  ('APLDCT','LIBNME','library_name','CHAR',10,0,0,'','Library Name','Library             Name','','','','',''),
  ('APLDCT','LIBSZE','library_size','DECIMAL',9,0,0,'','Library Size','Library             Size','','','','',''),
  ('APLDCT','LIBTYP','library_type','CHAR',1,0,0,'','Library Type','Library             Type','','','','','Y'),
  ('APLDCT','LNECNT','line_count','DECIMAL',5,0,0,'','Line Count','Line                Count','','','','',''),
  ('APLDCT','LOGDES','log_description','CHAR',50,0,0,'','Log Description','Log                 Description','','',
  '','',''),
  ('APLDCT','LOGMSG','log_message','VARCHAR',5000,0,100,'','Log Message','Log                 Message','','','','',''),
  ('APLDCT','LOGTYP','log_type','CHAR',20,0,0,'','Log Type','Log                 Type','','','','',''),
  ('APLDCT','LRGVAL','largest_value','DECIMAL',63,0,0,'','Largest Value','Largest             Value','','','','',''),
  ('APLDCT','MAXLEN','maximum_lenght','BIGINT',0,0,0,'','Maximum Length','Maximum             Length','','','','',''),
  ('APLDCT','MBR','member_','CHAR',10,0,0,'','Member','Member','','','','',''),
  ('APLDCT','MDE','mode_','CHAR',10,0,0,'','Mode','Mode','','','','',''),
  ('APLDCT','MNTDTM','maintenance_time_stamp','TIMESTAMP',0,0,0,'','Maintenance Date',
  'Maintenance         Date','0','','','CURRENT_TIMESTAMP',''),
  ('APLDCT','MNTJOB','maintenance_job','CHAR',28,0,0,'','Maintenance Job','Maintenance         Job','0','','','',''),
  ('APLDCT','MNTPGM','maintenance_program','CHAR',10,0,0,'','Maintenance Program','Maintenance         Program',
  '0','','','',''),
  ('APLDCT','MNTUSR','maintenance_user','CHAR',18,0,0,'','Maintenance User','Maintenance         User','0','','',
  'USER',''),
  ('APLDCT','MNUNME','menu_name','CHAR',50,0,0,'','Menu Name','Menu                Name','','','','',''),
  ('APLDCT','MNUOBJ','menu_object','CHAR',1,0,0,'','Menu Object','Menu                Object','','','','','Y'),
  ('APLDCT','MSDLEN','message_data_length','CHAR',5,0,0,'','Message Data Length',
  'Message             Data                Length','','','','',''),
  ('APLDCT','MSDLNE','message_file_data_line_number','CHAR',5,0,0,'','Message File Data Line Number',
  'Msg                 Data                Line','','','','',''),
  ('APLDCT','MSDTYP','message_data_type_substitutions','CHAR',8,0,0,'','Message Data Type (substitutions)',
  'Message             Data                Type','','','','','Y'),
  ('APLDCT','MSDVRY','message_data_varying_length','DECIMAL',5,0,0,'','Message Data Varying Length',
  'Message             Data                Vary Len','','','','',''),
  ('APLDCT','MSFDES','message_file_description','CHAR',40,0,0,'','Message File Description',
  'Message             File                Description','','','','',''),
  ('APLDCT','MSFLIB','message_file_library','CHAR',10,0,0,'','Message File Library',
  'Message             File                Library','','','','',''),
  ('APLDCT','MSFNME','message_file_name','CHAR',10,0,0,'','Message File Name',
  'Message             File                Name','','','','','Y'),
  ('APLDCT','MSGDES','message_description','CHAR',79,0,0,'','Message Description',
  'Message             Description','','','','',''),
  ('APLDCT','MSGIDN','message_identification_number','CHAR',7,0,0,'','Message Identification Number',
  'Message             Number','','','','',''),
  ('APLDCT','MSGTXT','message_text','VARCHAR',1040,0,20,'','Message Text','Message             TExt','','','','',''),
  ('APLDCT','NATTYP','native_type','CHAR',10,0,0,'','Native Type','Native              Type','','','','',''),
  ('APLDCT','NMR','is_numeric','CHAR',2,0,0,'','is Numeric','Numeric','','Numeric','','','Y'),
  ('APLDCT','NTE','note_','CHAR',60,0,0,'','Note','Note','','Note','','',''),
  ('APLDCT','NTEEXS','note_exists','CHAR',1,0,0,'','Note Exists','Note                Exists','','','','',''),
  ('APLDCT','NTEKEY','note_key','CHAR',10,0,0,'','Note Key','Note                Key','','','','',''),
  ('APLDCT','NTESEQ','note_sequence','DECIMAL',7,0,0,'','Note Sequence','Note                Sequence','','','','',''),
  ('APLDCT','OBJATR','object_attribute','CHAR',10,0,0,'','Object Attribute','Object              Attribute','','','',
  '','Y'),
  ('APLDCT','OBJAUTLST','object_authorization_list','CHAR',10,0,0,'','Object Authorization List',
  'Object              Authorization       List','','','','','Y'),
  ('APLDCT','OBJLIB','object_library','CHAR',10,0,0,'','Object library','Object              Library','','','','',''),
  ('APLDCT','OBJNME','object_name','CHAR',10,0,0,'','Object Name','Object              Name','','','','',''),
  ('APLDCT','OBJOWN','object_owner','CHAR',10,0,0,'','Object Owner','Object              Owner','','','',
  '''FABRICUT''',''),
  ('APLDCT','OBJTYP','object_type','CHAR',10,0,0,'','Object Type','Object              Type','','','','',''),
  ('APLDCT','OPT','sfl_option','NUMERIC',2,0,0,'','SFL Option','SFL                 Option','','','','',''),
  ('APLDCT','OPTION','option_','CHAR',2,0,0,'','Option','Option','','','','','Y'),
  ('APLDCT','PCDFLG','processed_flag','CHAR',1,0,0,'','Processed Flag','Processed           Flag','0','','','',''),
  ('APLDCT','PGMACTIDN','program_action_id','BIGINT',0,0,0,'','Program Action Id',
  'Program             Action              Id','','','','',''),
  ('APLDCT','PGMDES','program_description','CHAR',50,0,0,'','Program Description',
  'Program             Description','','','','',''),
  ('APLDCT','PGMFNCIDN','program_function_id','BIGINT',0,0,0,'','Program Function Id',
  'Program             Function            Id','','','','',''),
  ('APLDCT','PGMOPTIDN','program_options_id','BIGINT',0,0,0,'','Program Option Id',
  'Program             Option              Id','','','','',''),
  ('APLDCT','PGMMSTIDN','program_master_id','BIGINT',0,0,0,'','Program Master Id',
  'Program             Master              Id','','','','',''),
  ('APLDCT','PGMNME','program_name','CHAR',10,0,0,'','Program Name','Program             Name','','','','',''),
  ('APLDCT','PGMTYP','program_type','CHAR',1,0,0,'','Program Type','Program             Type','','','','','Y'),
  ('APLDCT','PGMUDFIDN','program_user_default_id','BIGINT',0,0,0,'','Program User Default Id',
  'Program User        Default             Id','','','','',''),
  ('APLDCT','PRCDES','procedure_description','CHAR',50,0,0,'','Procedure Description',
  'Procedure           Description','','','','',''),
  ('APLDCT','PRCNME','procedure_name','CHAR',10,0,0,'','Procedure Name','Procedure           Name','','','','',''),
  ('APLDCT','PRCTYP','procedure_type','CHAR',7,0,0,'','Procedure Type','Procedure           Type','','','','',''),
  ('APLDCT','PRDFLE','production_file','CHAR',1,0,0,'','Production File','Production          File','','','','','Y'),
  ('APLDCT','PRIKEY','primary_key','CHAR',1,0,0,'','Primary Key','Primary             Key','','','','','Y'),
  ('APLDCT','PRJNBR','project_number','CHAR',10,0,0,'','Project Number','Project             Number','0','','','',''),
  ('APLDCT','PTH','path_','CHAR',100,0,0,'','Path','Path                Path','','','','',''),
  ('APLDCT','PURABCIDN','purchasing_abc_inventory_class_id','BIGINT',0,0,0,'',
  'Purchasing ABC - Inventory Class Id','Purchasing          ABC Class           ID','','','','',''),
  ('APLDCT','RCDFMT','record_format','CHAR',10,0,0,'','Record Format','Record              Format','','','','',''),
  ('APLDCT','RCDFMTTYP','record_format_type','CHAR',10,0,0,'','Record Format Type',
  'Record              Format              Type','','','','',''),
  ('APLDCT','RCDIDN','record_id','BIGINT',0,0,0,'','Record Id','Record              Id','','','','',''),
  ('APLDCT','REFFLD','reference_field','CHAR',10,0,0,'','Reference Field','Reference           Field','','','','',''),
  ('APLDCT','REFFLE','reference_file','CHAR',10,0,0,'','Reference File','Referrence          File','','','','',''),
  ('APLDCT','REFLIB','reference_library','CHAR',10,0,0,'','Reference Library','Reference           Library','','',
  '','',''),
  ('APLDCT','REQALC','require_allocation','CHAR',1,0,0,'','Require Allocation','Require             Allocation','',
  '','N','','Y'),
  ('APLDCT','REQDBA','required_database_administrator','CHAR',10,0,0,'','Required Database Administrator',
  'Required            DB Admin','','','','',''),
  ('APLDCT','REQITR','required_it_requester','CHAR',10,0,0,'','Required IT Requester',
  'Required            IT Requester','','','','',''),
  ('APLDCT','REQLEN','require_length','CHAR',1,0,0,'','Require Length','Require Length','',
  'Require Length','N','','Y'),
  ('APLDCT','REQOWN','required_owner','CHAR',10,0,0,'','Required Owner','Required            Owner','','','','',''),
  ('APLDCT','SCHVAL','display_search_value','CHAR',40,0,0,'','Display Search Value',
  'Display             Search              Value','','','','',''),
  ('APLDCT','SCRLOCIDN','screen_loc_id','BIGINT',0,0,0,'','Screen Loc Id',
  'Screen              Loc                 Id','','','','',''),
  ('APLDCT','SCRSZE','screen_size','CHAR',1,0,0,'','Screen Size','Screen              Size','','','','','Y'),
  ('APLDCT','SECAUT','security_authorization','CHAR',10,0,0,'','Security Authorization',
  'Security            Authorization','','','','',''),
  ('APLDCT','SECPGM','security_program','CHAR',10,0,0,'','Security Program','Security            Program',
   '','','','',''),
  ('APLDCT','SEQNBR','sequence_number','SMALLINT',0,0,0,'','Sequence Number','Sequence            Number',
   '','','','',''),
  ('APLDCT','SMLVAL','smallest_value','DECIMAL',63,0,0,'','Smallest Value','Smallest            Value','','','','',''),
  ('APLDCT','SQLTYP','sql_type','CHAR',10,0,0,'','SQL Type','SQL                 Type','','','','',''),
  ('APLDCT','SRTCDE','sort_code','DECIMAL',2,0,0,'','Sort Code','Srt                 Cde','','','','',''),
  ('APLDCT','STRIDN','starting_id','BIGINT',0,0,0,'','Starting ID','Starting            ID','','','','',''),
  ('APLDCT','SYSLEN','system_length','DECIMAL',20,0,0,'','System Length','System              Length','','','','',''),
  ('APLDCT','SYSTYP','system_type','CHAR',10,0,0,'','System Type','System              Type','','','','',''),
  ('APLDCT','TBLNME','table_name','CHAR',50,0,0,'','Table Name','Table               Name','','','','',''),
  ('APLDCT','TBLTYP','table_type','CHAR',10,0,0,'','Table Type','Table               Type','','','','',''),
  ('APLDCT','TOTCNT','total_count','DECIMAL',6,0,0,'','Total Count','Total               Count','','','','',''),
  ('APLDCT','TRGADD','trigger_add','CHAR',1,0,0,'','Trigger add','Trigger             Add','','','','',''),
  ('APLDCT','TRGCNT','trigger_count','DECIMAL',5,0,0,'','Trigger Count','Trigger             Count','','','','',''),
  ('APLDCT','TRGDEL','trigger_delete','CHAR',1,0,0,'','Trigger Delete','Trigger             Delete','','','','',''),
  ('APLDCT','TRGFLE','trigger_file','CHAR',10,0,0,'','Trigger File','Trigger             File','','','','',''),
  ('APLDCT','TRGLIB','trigger_library','CHAR',10,0,0,'','Trigger Library','Trigger             Library','','','','',''),
  ('APLDCT','TRGNME','trigger_name','CHAR',10,0,0,'','Trigger Name','Trigger             Name','','','','',''),
  ('APLDCT','TRGPGM','trigger_program','CHAR',10,0,0,'','Trigger Program','Trigger             Program','','','','',''),
  ('APLDCT','TRGUPD','trigger_update','CHAR',1,0,0,'','Trigger Update','Trigger             Update','','','','',''),
  ('APLDCT','TSTFLEIDN','test_file_id','BIGINT',0,0,0,'','Test File Id','Test                File                Id','',
  '','','',''),
  ('APLDCT','UDFDES','user_default_description','CHAR',60,0,0,'','User Default Description',
  'User Default        Default             Description','','','','',''),
  ('APLDCT','UDFDFT','user_default_default_value','CHAR',20,0,0,'','User Default Default Value',
  'User Default        Default             Value','','','','',''),
  ('APLDCT','UDFDPT','user_default_department','CHAR',10,0,0,'','User Default Department',
  'User                Default             Department','','','','',''),
  ('APLDCT','UDFDTLIDN','user_default_detail_id','BIGINT',0,0,0,'','User Default Detail Id',
  'User Default        Detail              Id','','','','',''),
  ('APLDCT','UDFKEY','user_default_key','CHAR',20,0,0,'','User Default Key',
  'User                Default             Key','','','','',''),
  ('APLDCT','UDFMSTIDN','user_default_master_id','BIGINT',0,0,0,'','User Default Master Id',
  'User Default        Master              Id','','','','',''),
  ('APLDCT','UDFOPT','user_default_option','CHAR',10,0,0,'','User Default Option',
  'User Default        Default             Option','','','','',''),
  ('APLDCT','UDFUSR','user_default_user','CHAR',10,0,0,'','User Default User',
  'User Default        Default             User','','','','',''),
  ('APLDCT','UDFVAL','user_default_value','CHAR',20,0,0,'','User Default Value',
  'User Default        Default             Value','','','','',''),
  ('APLDCT','USR','user_','CHAR',10,0,0,'','User','User','','','','',''),
  ('APLDCT','USRAUT','program_user_authority','CHAR',6,0,0,'','Program User Authority',
  'Program             User                Authority','','','','*OWNER','Y'),
  ('APLDCT','USRCNF','user_configurable','CHAR',1,0,0,'','User Configurable',
  'User                Configurable','','','','',''),
  ('APLDCT','VAL','value_','CHAR',10,0,0,'','Value','Value','','','','',''),
  ('APLDCT','VARDES','variable_description','CHAR',50,0,0,'','Variable Description',
  'Variable            Description','','','','',''),
  ('APLDCT','VARNME','variable_name','CHAR',20,0,0,'','Variable Name','Variable            Name','','','','',''),
  ('APLDCT','VARTYP','variable_type','CHAR',15,0,0,'','Variable Type','Variable            Type','','','','',''),
  ('APLDCT','WEBAPL','web_application','CHAR',1,0,0,'','Web Application','Web                 Application','','',
  '','','Y'),
  ('APLDCT','WID','width_','DECIMAL',5,2,0,'','Width','Width','','','','',''),
  ('APLDCT','Zon','zoned_','NUMERIC',9,2,0,'','Zoned','Zoned','','','','',''),
  ('APLDCT','CRTSTR','create_string','CHAR',70,0,0,'','Create String','Create String','','','','',''),
  ('APLDCT','MNTSTR','maintenance_string','CHAR',70,0,0,'','Maintenance String','Maintenance String','','','','','');

  // these are some new fields added for the OTO and USRMST systems */
  Exec SQL
  insert into dctFld
  (dctNme,fldNme,fldNmeSql,fldTyp,fldLen,colTxt,colHdg,fldEnm)
  Values
  ('APLDCT','OUTMDL','output_model','CHAR','2','Output Model','Output Model',''),
  ('APLDCT','PRTOUT','print_output','CHAR','1','Print Output','Print Output','Y'),
  ('APLDCT','EMLOUT','email_output','CHAR','1','Email Output','Email Output','Y'),
  ('APLDCT','ARCOUT','archive_output','CHAR','1','Archive Output','Archive Output','Y'),
  ('APLDCT','FAXOUT','fax_output','CHAR','1','Fax Output','Fax Output','Y'),
  ('APLDCT','PSTFLG','post_flag','CHAR','1','Post Flag','Post Flag','Y'),
  ('APLDCT','PRTDEV','print_device','CHAR','10','Print Device','Print Device',''),
  ('APLDCT','PRTOTQ','print_output_queue','CHAR','10','Print Output Queue','Print Output Queue',''),
  ('APLDCT','HLDOUT','hold_output','CHAR','5','Hold Output','Hold Output','Y'),
  ('APLDCT','SAVOUT','save_output','CHAR','5','Save Output','Save Output','Y'),
  ('APLDCT','PRTFRM','printer_form','CHAR','10','Printer Form','Printer Form',''),
  ('APLDCT','USRDTA','user_data','CHAR','10','User Data','User Data',''),
  ('APLDCT','NBRCPY','number_of_copies','CHAR','3','Number of Copies','Number of Copies',''),
  ('APLDCT','PRTQUL','print_quality','CHAR','10','Print Quality','Print Quality','Y'),
  ('APLDCT','PRTOVL','printer_overlay','CHAR','10','Printer Overlay','Printer Overlay',''),
  ('APLDCT','ARCFLR ','archive_folder','CHAR','128','Archive Folder','Archive Folder',''),
  ('APLDCT','AARFLR ','auto_archive_folder','CHAR','128','Auto Archive Folder','Auto Archive Folder',''),
  ('APLDCT','FAXNBR ','fax_number','CHAR','20','Fax Number','Fax Number',''),
  ('APLDCT','EMLADD ','email_address','CHAR','60','Email Address','Email Address',''),
  ('APLDCT','EMLNME ','email_name','CHAR','30','Email Name','Email Name',''),
  ('APLDCT','FRMEML ','from_email_address','CHAR','60','From Email Address','From Email Address',''),
  ('APLDCT','FRMNME ','from_email_name','CHAR','30','From Email Name','From Email Name',''),
  ('APLDCT','CC1EML ','cc_email_address_1','CHAR','60','CC Email Address 1','CC Email Address 1',''),
  ('APLDCT','CC1NME ','cc_email_name_1','CHAR','30','CC Email Name 1','CC Email Name 1',''),
  ('APLDCT','CC2EML ','cc_email_address_2','CHAR','60','CC Email Address 2','CC Email Address 2',''),
  ('APLDCT','CC2NME ','cc_email_name_2','CHAR','30','CC Email Name 2','CC Email Name 2',''),
  ('APLDCT','CC3EML ','cc_email_address_3','CHAR','60','CC Email Address 3','CC Email Address 3',''),
  ('APLDCT','CC3NME ','cc_email_name_','CHAR','30','CC Email Name 3','CC Email Name 3',''),
  ('APLDCT','BCCEML ','bcc_email_address','CHAR','60','BCC Email Address','BCC Email Address',''),
  ('APLDCT','BCCNME ','bcc_email_name','CHAR','30','BCC Email Name','BCC Email Name',''),
  ('APLDCT','EMLSBJ ','email_subject','CHAR','60','Email Subject','Email Subject',''),
  ('APLDCT','ATATYP ','attachment_type','CHAR','5','Attachment Type','Attachment Type','Y'),
  ('APLDCT','VLDATA ','valid_attachment_types','CHAR','1','Valid Attachment Types','Valid Attachment Types','Y'),
  ('APLDCT','ATANME ','attachment_name','CHAR','128','Attachment Name','Attachment Name',''),
  ('APLDCT','ATAFMT','attachment_format','CHAR','1','Attachment Format','Attachment Format','Y'),
  ('APLDCT','CRTXMA','create_xml_attribute_file','CHAR','1','Create XML Attribute File',
   'Create XML Attribute File','Y'),
  ('APLDCT','EMLMSG01','email_message_1','CHAR','75','Email Message 1','Email Message 1',''),
  ('APLDCT','EMLMSG02','email_message_2','CHAR','75','Email Message 2','Email Message 2',''),
  ('APLDCT','EMLMSG03','email_message_3','CHAR','75','Email Message 3','Email Message 3',''),
  ('APLDCT','EMLMSG04','email_message_4','CHAR','75','Email Message 4','Email Message 4',''),
  ('APLDCT','EMLMSG05','email_message_5','CHAR','75','Email Message 5','Email Message 5',''),
  ('APLDCT','EMLMSG06','email_message_6','CHAR','75','Email Message 6','Email Message 6',''),
  ('APLDCT','EMLMSG07','email_message_7','CHAR','75','Email Message 7','Email Message 7',''),
  ('APLDCT','EMLMSG08','email_message_8','CHAR','75','Email Message 8','Email Message 8',''),
  ('APLDCT','EMLMSG09','email_message_9','CHAR','75','Email Message 9','Email Message 9',''),
  ('APLDCT','EMLMSG10','email_message_10','CHAR','75','Email Message 10','Email Message 10',''),
  ('APLDCT','EMLMSG11','email_message_11','CHAR','75','Email Message 11','Email Message 11',''),
  ('APLDCT','EMLMSG12','email_message_12','CHAR','75','Email Message 12','Email Message 12',''),
  ('APLDCT','PSTFLR','post_folder','CHAR','128','Post Folder','Post Folder',''),
  ('APLDCT','PRTFLE','printer_file','CHAR','10','Printer File','Printer File',''),
  ('APLDCT','PGEWID','page_width','CHAR','3','Page Width','Page Width',''),
  ('APLDCT','PGELEN','page_length','CHAR','3','Page Length','Page Length',''),
  ('APLDCT','ENDCHR','end_character','CHAR','1','End Character','End Character',''),
  ('APLDCT','RPTTTL','report_title','CHAR','50','Report Title','Report Title',''),
  ('APLDCT','PSTBCH','post_batch','BIGINT','0','Post Batch','Post Batch',''),
  ('APLDCT','AUDFLD','auit_field','CHAR','1','Audit Field','Audit Field','Y'),
  ('APLDCT','ENCFLD','encrypt_field','CHAR','1','Encrypt Field','Encrypt Field','Y'),
  ('APLDCT','ALWEML','allow_email','CHAR','1','Allow Email','Allow Email','Y'),
  ('APLDCT','ALWARC','allow_archive','CHAR','1','Allow Archive','Allow Archive','Y'),
  ('APLDCT','ALWFAX','allow_fax','CHAR','1','AllowFax','AllowFax','Y'),
  ('APLDCT','AUTOPT','auto_display_output_options','CHAR','1',
   'Auto Display Output Options','Auto Display Output Options',''),
  ('APLDCT','OTQMSTIDN','output_queue_id','BIGINT','0','Output Qqueue Id','Output Qqueue Id',''),
  ('APLDCT','OTQLIB','ouput_queue_library','CHAR','10','Ouput Queue Library','Ouput Queue Library',''),
  ('APLDCT','OTQNME','output_queue_name','CHAR','10','Output Queue Name','Output Queue Name',''),
  ('APLDCT','PCYNBR','policy_number','CHAR','10','Policy Number','Policy Number',''),
  ('APLDCT','PRTTYP','printer_type','CHAR','10','Printer Ttype','Printer Ttype',''),
  ('APLDCT','FRMTYP','form_type','CHAR','10','Form Type','Form Type',''),
  ('APLDCT','USRNME','user_name','CHAR','30','User Name','User Name',''),
  ('APLDCT','ROLNME','role_name','CHAR','30','Role Name','Role Name',''),
  ('APLDCT','USRROLIDN','user_role_id','BIGINT','0','User Role Id','User Role Id',''),
  ('APLDCT','ROLMSTIDN','role_master_id','BIGINT','0','Role Master Id','Role Master Id',''),
  ('APLDCT','ROLAPRIDN','role_approval_id','BIGINT','0','Role Approval Id','Role Approval Id',''),
  ('APLDCT','ROLAPR','role_approved','CHAR','1','Role Approved','Role Approved','Y'),
  ('APLDCT','LNGCMT','long_comment','VARCHAR','250','Long Comment','Long Comment',''),
  ('APLDCT','USRMSTIDN','user_master_id','BIGINT','0','User Master Id','User Master Id',''),
  ('APLDCT','USRPRF','user_profile','CHAR','10','User Profile','User Profile',''),
  ('APLDCT','USRDPT','user_department','VARCHAR','50','User Department','User Department',''),
  ('APLDCT','USRCLS','user_class','CHAR','10','User Class','User Class',''),
  ('APLDCT','USRINT','user_initials','CHAR','3','User Initials','User Initials',''),
  ('APLDCT','USRTTL','user_title','VARCHAR','30','User Title','User Title',''),
  ('APLDCT','USRSTS','user_status','CHAR','10','User Status','User Status',''),
  ('APLDCT','USREML','user_email','CHAR','50','User Email','User Email',''),
  ('APLDCT','USROQN','user_output_queue_name','CHAR','10','User Output Queue Name','User Output Queue Name',''),
  ('APLDCT','USROQL','user_output_queue_library','CHAR','10','User Output Queue Library'
                    ,'User Output Queue Library',''),
  ('APLDCT','FSTNME','first_name','VARCHAR','20','First Name','First Name',''),
  ('APLDCT','LSTNME','last_name','VARCHAR','20','Last Name','Last Name',''),
  ('APLDCT','OTOEML','output_options_email','CHAR','50','Output Options Email','Output Options Email',''),
  ('APLDCT','OTONME','output_options_name','CHAR','50','Output Options Name','Output Options Name',''),
  ('APLDCT','USREMP','user_employee_number','CHAR','15','User Employee Number','User Employee Number',''),
  ('APLDCT','USRTXT','user_text','VARCHAR','50','User Profile Text','User Profile Text',''),
  ('APLDCT','GRPPRF','group_profile','CHAR','10','Group Profile','Group Profile',''),
  ('APLDCT','EMPNBR','employee_number','CHAR','10','Employee Number','Employee Number',''),
  ('APLDCT','PHNNBR','phone_number','CHAR','12','Phone Number','Phone Number',''),
  ('APLDCT','PHNEXT','phone_extension','CHAR','6','Phone Extension','Phone Extension',''),
  ('APLDCT','ACGCDE','accounting_code','CHAR','15','Accounting Code','Accounting Code',''),
  ('APLDCT','CMPDES','comparison_description','CHAR','30','Comparison Description','Comparison Description',''),
  ('APLDCT','SRCLIB','source_library','CHAR','10','Source Library','Source Library',''),
  ('APLDCT','SRCFLE','source_file','CHAR','10','Source File','Source File',''),
  ('APLDCT','SRCMBR','source_member','CHAR','10','Source Member','Source Member','')
  ;

  // Add fields to ERPDCT
  Exec SQL
  insert into dctFld
  (dctNme,fldNme,fldNmeSql,fldTyp,fldLen,colTxt,colHdg,fldEnm)
  Values
  ('ERPDCT','CMPNBR' ,'company_number'        ,'DECIMAL',3 ,'Company Number'        ,'Company Number'        ,' '),
  ('ERPDCT','CONADD1','contact_address_1'     ,'VARCHAR',30,'Contact Address 1'     ,'Contact Address 1'     ,' '),
  ('ERPDCT','CONADD2','contact_address_2'     ,'VARCHAR',30,'Contact Address 2'     ,'Contact Address 2'     ,' '),
  ('ERPDCT','CONADD3','contact_address_3'     ,'VARCHAR',30,'Contact Address 3'     ,'Contact Address 3'     ,' '),
  ('ERPDCT','CONCTY' ,'contact_city'          ,'VARCHAR',30,'Contact City'          ,'Contact City'          ,' '),
  ('ERPDCT','CONCOU' ,'contact_country_code'  ,'VARCHAR',3 ,'Contact Country Code'  ,'Contact Country Code'  ,' '),
  ('ERPDCT','CONEXT' ,'contact_extension'     ,'VARCHAR',6 ,'Contact Extension'     ,'Contact Extension'     ,' '),
  ('ERPDCT','CONFAX' ,'contact_fax'           ,'VARCHAR',15,'Contact Fax'           ,'Contact Fax'           ,' '),
  ('ERPDCT','CONNME' ,'contact_name'          ,'VARCHAR',30,'Contact Name'          ,'Contact Name'          ,' '),
  ('ERPDCT','CONPHN' ,'contact_phone'         ,'VARCHAR',15,'Contact Phone'         ,'Contact Phone'         ,' '),
  ('ERPDCT','CONPSC' ,'contact_postal_code'   ,'VARCHAR',15,'Contact Postal Code'   ,'Contact Postal Code'   ,' '),
  ('ERPDCT','CONSTA' ,'contact_state'         ,'VARCHAR',2 ,'Contact State'         ,'Contact State'         ,' '),
  ('ERPDCT','CONTTL' ,'contact_title'         ,'VARCHAR',30,'Contact Title'         ,'Contact Title'         ,' '),
  ('ERPDCT','CNYCDE' ,'contact_type_code'     ,'VARCHAR',3 ,'Contact Type Code'     ,'Contact Type Code'     ,' '),
  ('ERPDCT','CNYDES' ,'contact_type_description','VARCHAR',30,'Contact Type Description'
                     ,'Contact Type Description',' '),
  ('ERPDCT','CONEML' ,'contact_email'         ,'VARCHAR',50,'Contact Email'         ,'Contact Email'         ,' '),
  ('ERPDCT','COUCDE' ,'country_code'          ,'CHAR   ',3 ,'Country Code'          ,'Country Ccode'         ,' '),
  ('ERPDCT','COUNME' ,'country_name'          ,'VARCHAR',50,'Country Name'          ,'Country Name'          ,' '),
  ('ERPDCT','INCINA' ,'include_in_address'    ,'CHAR   ',1 ,'Include in Address'    ,'Include in Address'    ,'Y'),
  ('ERPDCT','LNGCMT' ,'long_comment'          ,'VARCHAR',25,'Long Comment'          ,'Long Comment'          ,' '),
  ('ERPDCT','NTEPRI' ,'note_priority'         ,'CHAR   ',1 ,'Note Priority'         ,'note Priority'         ,'Y'),
  ('ERPDCT','NTETYP' ,'note_type'             ,'CHAR   ',3 ,'Note Type'             ,'Note Type'             ,'Y'),
  ('ERPDCT','VNDNBR' ,'vendor_number'         ,'DECIMAL',8 ,'Vendor Number'         ,'Vendor Number'         ,' '),
  ('ERPDCT','ACVDES' ,'active_description'    ,'CHAR'   ,8 ,'Active Description'    ,'Active              Desc',' '),
  ('ERPDCT','ACVROW' ,'active_row'            ,'CHAR'   ,1 ,'Active Row'            ,'Active              Row','Y'),
  ('ERPDCT','PGMNME' ,'program_name'          ,'CHAR'   ,10,'Program Name'          ,'Program             Name',' '),
  ('ERPDCT','MDE'    ,'mode_'                 ,'CHAR'   ,10,'Mode'                  ,'Mode'                    ,' '),
  ('ERPDCT','SRTCDE' ,'sort_code'             ,'DECIMAL',2 ,'Sort Code'             ,'Srt                 Cde' ,' '),
  ('ERPDCT','RPTTTL' ,'report_title'          ,'CHAR'   ,50,'Report Title'          ,'Report Title'            ,' '),
  ('ERPDCT','SCHVAL' ,'display_search_value'  ,'CHAR'   ,40,'Display Search Value'
                     ,'Display             Search              Value',' '),
  ('ERPDCT','SCRSZE' ,'screen_size'           ,'CHAR'   ,1 ,'Screen Size'           ,'Screen              Size','Y'),
  ('ERPDCT','OPTION' ,'option_'               ,'CHAR'   ,2 ,'Option'                ,'Option'                  ,'Y'),
  ('ERPDCT','COUMSTIDN','country_id'          ,'BIGINT',0, 'Country Id','Country             Id' ,' '),
  ('ERPDCT','VNDNTEIDN','vendor_note_id'      ,'BIGINT',0,'Vendor Note Id'
                       ,'Vendor              Note                Id' ,' '),
  ('ERPDCT','VNDCNYIDN','vendor_contact_type_id','BIGINT',0,'Vendor Contact Type Id'
                       ,'Vendor              Contact             Type Id',' '),
  ('ERPDCT','VNDCONIDN','vendor_contact_id'   ,'BIGINT',0,'Vendor Contact Id'
                       ,'Vendor              Contact             Id',' '),
  ('ERPDCT','CRTSTR'   ,'create_string'       ,'CHAR',70,'Create String','Create String',' '),
  ('ERPDCT','MNTSTR'   ,'maintenance_string'  ,'CHAR',70,'Maintenance String','Maintenance String',' ')

  ;

  // populate DCTVAL
  Exec SQL Truncate APLLIB.DCTVAL;
  Exec SQL Alter Table APLLIB.DCTVAL Alter Column dctValIdn Restart With 1;
  Exec SQL
  insert into APLLIB.DCTVAL
  (dctNme,fldNme,enmVal,enmDes)
  values('APLDCT','ACVROW','0','Inactive'),
        ('APLDCT','ACVROW','1','Active'),
        ('APLDCT','ALWALC','N','No'),
        ('APLDCT','ALWALC','Y','Yes'),
        ('APLDCT','ALWDEC','N','No'),
        ('APLDCT','ALWDEC','Y','Yes'),
        ('APLDCT','ALWLEN','N','No'),
        ('APLDCT','ALWLEN','Y','Yes'),
        ('APLDCT','APL','APP','Accounts Payable'),
        ('APLDCT','APL','ARR','Acounts Receivable'),
        ('APLDCT','APL','NVT','Inventory'),
        ('APLDCT','APL','OEI','Order Entry'),
        ('APLDCT','APL','PAY','Payroll'),
        ('APLDCT','APL','SYS','System (APLLIB)'),
        ('APLDCT','CHGSCD','N','No'),
        ('APLDCT','CHGSCD','Y','Yes'),
        ('APLDCT','CNFEXS','N','No'),
        ('APLDCT','CNFEXS','Y','Yes'),
        ('APLDCT','DFTAUT','0','Not Authorized'),
        ('APLDCT','DFTAUT','1','All Authority'),
        ('APLDCT','DFTAUT','5','Inquiry Only'),
        ('APLDCT','FLDENM','N','No'),
        ('APLDCT','FLDENM','Y','Yes'),
        ('APLDCT','FLDLVL','1','Active Row'),
        ('APLDCT','FLDLVL','2','Indentity'),
        ('APLDCT','FLDLVL','3','Primary Key'),
        ('APLDCT','FLDLVL','4','File Attributes'),
        ('APLDCT','FLDLVL','5','Create/Maintenance Fields'),
        ('APLDCT','FLDSTS','1','Entry'),
        ('APLDCT','FLDSTS','2','Production'),
        ('APLDCT','FLDSTS','3','Pending Changes'),
        ('APLDCT','FLDSTS','4','Changes Scheduled'),
        ('APLDCT','FLDSTS','5','Pending Delete'),
        ('APLDCT','FLDSTS','6','Delete Scheduled'),
        ('APLDCT','FLDSTS','9','Inactive'),
        ('APLDCT','FLEERR','N','No'),
        ('APLDCT','FLEERR','Y','Yes'),
        ('APLDCT','FLESTS','1','Entry'),
        ('APLDCT','FLESTS','2','Development'),
        ('APLDCT','FLESTS','3','Production'),
        ('APLDCT','FLESTS','4','Pending Changes'),
        ('APLDCT','FLESTS','5','Changes Scheduled'),
        ('APLDCT','FLESTS','9','Inactive'),
        ('APLDCT','FRCLEN','N','No'),
        ('APLDCT','FRCLEN','Y','Yes'),
        ('APLDCT','HLPTYP','1','Dictionary Field'),
        ('APLDCT','HLPTYP','2','Screen Field'),
        ('APLDCT','HLPTYP','3','Screen Function Key'),
        ('APLDCT','HLPTYP','4','Screen SFL Option'),
        ('APLDCT','HLPTYP','5','Screen Header'),
        ('APLDCT','HLPTYP','6','System Default'),
        ('APLDCT','IDXUNI','E','Encoded Vector Index'),
        ('APLDCT','IDXUNI','N','Not Unique'),
        ('APLDCT','IDXUNI','Y','Unique Index'),
        ('APLDCT','LIBTYP','1','Production'),
        ('APLDCT','LIBTYP','2','Auxillery'),
        ('APLDCT','LIBTYP','3','Development'),
        ('APLDCT','LIBTYP','4','Tool/External'),
        ('APLDCT','LIBTYP','5','System+'),
        ('APLDCT','MNUOBJ','N','No'),
        ('APLDCT','MNUOBJ','Y','Yes'),
        ('APLDCT','MSDTYP','*CHAR','Character'),
        ('APLDCT','MSDTYP','*DEC','Decimal'),
        ('APLDCT','MSDTYP','*DTS','Date Time Stamp'),
        ('APLDCT','MSDTYP','*HEX','Hexadecimal ie: (x''C0F4'')'),
        ('APLDCT','MSDTYP','*QTDCHAR','Quoted Character ie: (''Monday, the 1st'')'),
        ('APLDCT','MSDTYP','*UTC','Universal Time ie:(x''2022123117300000'')'),
        ('APLDCT','MSFNME','ENVIRONMNT','Environment Definition'),
        ('APLDCT','MSFNME','FABMSGF','Messages for All Fabricut Programs'),
        ('APLDCT','NMR','N','No'),
        ('APLDCT','NMR','Y','Yes'),
        ('APLDCT','OBJATR','DATA','Data (PF/LF)'),
        ('APLDCT','OBJATR','DSPF','Display File (DSPF)'),
        ('APLDCT','OBJAUTLST','DEVELOPER','Developer accessto data'),
        ('APLDCT','OBJAUTLST','FABRICUT','Normal non payroll authority'),
        ('APLDCT','OBJAUTLST','QUESTIV','Restricted Payroll Data'),
        ('APLDCT','OPTION','VP','Validate, prompt if not valid'),
        ('APLDCT','OPTION','1','Select or Create'),
        ('APLDCT','OPTION','13','Reactivate'),
        ('APLDCT','OPTION','2','Update'),
        ('APLDCT','OPTION','3','Copy'),
        ('APLDCT','OPTION','4','Deactivate'),
        ('APLDCT','OPTION','5','Inquiry'),
        ('APLDCT','OPTION','7','Rename'),
        ('APLDCT','OPTION','8','Position To'),
        ('APLDCT','PGMTYP','B','Batch Program'),
        ('APLDCT','PGMTYP','C','Cl Program'),
        ('APLDCT','PGMTYP','D','Display Program'),
        ('APLDCT','PGMTYP','F','Display File'),
        ('APLDCT','PGMTYP','N','Binder Source'),
        ('APLDCT','PGMTYP','P','Panel Group'),
        ('APLDCT','PGMTYP','S','Stored Procedure'),
        ('APLDCT','PGMTYP','T','Table Function'),
        ('APLDCT','PGMTYP','U','User Defined Function'),
        ('APLDCT','PGMTYP','V','Service Program'),
        ('APLDCT','PRDFLE','N','No'),
        ('APLDCT','PRDFLE','Y','Yes'),
        ('APLDCT','PRIKEY','N','No'),
        ('APLDCT','PRIKEY','Y','Yes'),
        ('APLDCT','REQALC','N','No'),
        ('APLDCT','REQALC','Y','Yes'),
        ('APLDCT','REQLEN','N','No'),
        ('APLDCT','REQLEN','Y','Yes'),
        ('APLDCT','SCRSZE','1','80X24'),
        ('APLDCT','SCRSZE','2','132X27'),
        ('APLDCT','USRAUT','*OWNER','Object Owner Authority'),
        ('APLDCT','USRAUT','*USER','User Authority'),
        ('APLDCT','WEBAPL','N','No'),
        ('APLDCT','WEBAPL','Y','Yes'),
        ('APLDCT','PRTOUT','Y','Yes'),
        ('APLDCT','PRTOUT','N','No'),
        ('APLDCT','EMLOUT','Y','Yes'),
        ('APLDCT','EMLOUT','N','No'),
        ('APLDCT','ARCOUT','Y','Yes'),
        ('APLDCT','ARCOUT','N','No'),
        ('APLDCT','FAXOUT','Y','Yes'),
        ('APLDCT','FAXOUT','N','No'),
        ('APLDCT','PSTFLG','Y','Yes'),
        ('APLDCT','PSTFLG','N','No'),
        ('APLDCT','HLDOUT','*YES','Yes'),
        ('APLDCT','HLDOUT','*NO','No'),
        ('APLDCT','SAVOUT','*YES','Yes'),
        ('APLDCT','SAVOUT','*NO','No'),
        ('APLDCT','PRTQUL','*STD','Standard'),
        ('APLDCT','PRTQUL','*DEVD','Device Default'),
        ('APLDCT','PRTQUL','*DRAFT','Draft '),
        ('APLDCT','PRTQUL','*NLQ','Near Letter Qualitty'),
        ('APLDCT','PRTQUL','*FASTDRAFT','Fast Draft"'),
        ('APLDCT','ATATYP','*XML','XML'),
        ('APLDCT','ATATYP','*XSLX','Excel'),
        ('APLDCT','ATATYP','*CSV','Comma Seperated Variable (CSV)'),
        ('APLDCT','ATATYP','*TXT','Text File'),
        ('APLDCT','ATATYP','*PDF','PDF File'),
        ('APLDCT','VLDATA',' ','PDF,TIFF'),
        ('APLDCT','VLDATA','2','PDF,TIFF,CSV'),
        ('APLDCT','VLDATA','3','PDF,TIFF,CSV,XML'),
        ('APLDCT','VLDATA','4','PDF,TIFF,CSV,XML,Excel'),
        ('APLDCT','ATAFMT','1','Data'),
        ('APLDCT','ATAFMT','2','Report'),
        ('APLDCT','CRTXMA','Y','Yes'),
        ('APLDCT','CRTXMA','N','No'),
        ('APLDCT','AUDFLD','Y','Yes'),
        ('APLDCT','AUDFLD','N','No'),
        ('APLDCT','ENCFLD','Y','Yes'),
        ('APLDCT','ENCFLD','N','No'),
        ('APLDCT','ALWEML','Y','Yes'),
        ('APLDCT','ALWEML','N','No'),
        ('APLDCT','ALWARC','Y','Yes'),
        ('APLDCT','ALWARC','N','No'),
        ('APLDCT','ALWFAX','Y','Yes'),
        ('APLDCT','ALWFAX','N','No'),
        ('APLDCT','AUTOPT','Y','Yes'),
        ('APLDCT','AUTOPT','N','No'),
        ('APLDCT','ROLAPR','Y','Yes'),
        ('APLDCT','ROLAPR','N','No')
  ;

  Exec SQL
  insert into APLLIB.DCTVAL
  (dctNme,fldNme,enmVal,enmDes)
  values('ERPDCT','ACVROW','0','Inactive'),
        ('ERPDCT','ACVROW','1','Active'),
        ('ERPDCT','SCRSZE','1','80X24'),
        ('ERPDCT','SCRSZE','2','132X27'),
        ('ERPDCT','INCINA','N','No'),
        ('ERPDCT','INCINA','Y','Yes'),
        ('ERPDCT','NTEPRI','N','Normal'),
        ('ERPDCT','NTEPRI','D','Default'),
        ('ERPDCT','NTEPRI','H','High Priority'),
        ('ERPDCT','NTETYP','COM','Comment'),
        ('ERPDCT','NTETYP','CAL','Call'),
        ('ERPDCT','NTETYP','COL','Collection')
  ;

  // This creates the APLDCT file
  // this is done just to get started on the dictionary master system,
  // once that system is created, it will take over control of this file

  // APLDCT is a dictionary file controled by the DCTMST system, however
  // the DCTMST system cannot be built without the APLDCT file, so it
  // must first be manually created.

  // This program only adds enough columns to build DCTFLSB8 and DCTFLDB9,
  // those programs can be used to build the rest of the table, using the
  // data populated in DATASEED.
  Exec SQL Drop Table APLLIB/APLDCT;
  Exec SQL
    Create or Replace Table APLLIB/APLDCT (
        active_row               for Column acvRow    Char(1) not null with default '1',
        dictionary_name          for column dctNme    char(10) not null with default,
        field_name               for column fldNme    char(10) not null with default,
        field_type               for column fldTyp    char(10) not null with default,
        flied_lenght             for column fldLen    decimal(5) not null with default,
        field_scale              for column fldScl    decimal(2) not null with default,
        field_allocation         for column fldAlc    decimal(5) not null with default,
        column_text              for column colTxt    char(50) not null with default,
        caolumn_heading          for column colHdg    char(60) not null with default,
        allow_null               for column alwNul    char(1) not null with default,
        default_value            for column dftVal    char(60) not null with default,
        field_name_sql           for column fldNmeSQL char(40) not null with default,
        require_length           for column reqLen    char(10) not null with default,
        allows_decimal_positions for column alwDec    char(1) not null with default,
        allow_allocation         for column alwAlc    char(1) not null with default,
        creation_timestamp       for Column crtDtm    timestamp not null with default current timestamp,
        creation_user            for Column crtUsr    char(18) not null with default user,
        creation_job             for Column crtJob    char(28) not null with default,
        creation_program         for Column crtPgm    char(10) not null with default,
        function_key             for Column fncKey    char(10) not null with default,
        description              for Column des       char(40) not null with default,
        option_                  for Column option    char(2) not null with default,
        enumerated_description   for Column enmDes    char(40) not null with default,
        enumerated_value         for Column enmVal    char(10) not null with default,
        user_                    for Column usr       char(10) not null with default,
        user_default_key         for Column udfKey    char(20) not null with default,
        user_default_value       for Column udfVal    char(20) not null with default,
        program_name             for Column pgmNme    char(10) not null with default
        )
      RcdFmt APLDCTR;
  Exec SQL Label on Table APLLIB/APLDCT is 'Application Dictionary';

  // Creates the SCRLOC file
  Exec SQL Drop Index APLLIB/SCRLOCMBR;

  Exec SQL
    Create or Replace Table APLLIB/SCRLOC (
        active_row for Column AcvRow Char(1) not null with default '1',
        screen_location_id for Column scrLocIdn bigInt
            not null generated always as identity (start with 1 increment by 1),
        library_name for Column lib char(10) not null with default,
        file_name for Column fle char(10) not null with default,
        member_name for Column mbr char(10) not null with default,
        record_format for Column rcdFmt char(10) not null with default,
        record_format_type for Column rcdFmtTyp char(10) not null with default,
        field_name for Column fldNme char(10) not null with default,
        field_column for Column fldCol decimal(3) not null with default,
        field_row for Column fldRow decimal(3) not null with default,
        field_length for Column fldLen decimal(3) not null with default,
        field_scale for Column fldScl decimal(3) not null with default,
        file_type for Column fldTyp char(10) not null with default,
        extended_type for Column extTyp char(10) not null with default,
        reference_library for Column refLib char(10) not null with default,
        reference_file for Column refFle char(10) not null with default,
        reference_field for Column refFld char(10) not null with default,
        creation_timestamp for Column crtDtm timestamp not null with default current timestamp,
        creation_user for Column crtUsr char(18) not null with default user,
        creation_job for Column crtJob char(28) not null with default,
        creation_program for Column crtPgm char(10) not null with default
        )
      RcdFmt SCRLOCR;

  Exec SQL Alter Table APLLIB.SCRLOC add Constraint APLLIB.SCRLOC Primary Key( lib,fle,mbr,rcdfmt,fldNme );
  Exec SQL Label on Table APLLIB/SCRLOC is 'Screen Location File';

  Exec SQL
    Label on Column APLLIB.SCRLOC
     (ACTIVE_ROW         is 'Active              Row' ,
      screen_location_id is 'Screen              Location            Id' ,
      library_name       is 'Library             Name' ,
      field_name         is 'Field               Name' ,
      member_name        is 'Member              Name' ,
      record_format      is 'Record              Format' ,
      record_format_type is 'Record              Format              Type' ,
      field_name         is 'Field               Name                ' ,
      field_column       is 'Field               Column              ' ,
      field_row          is 'Field               Row                 ' ,
      field_length       is 'Field               Length              ' ,
      field_scale        is 'Field               Scale               ' ,
      file_type          is 'File                Type                ' ,
      extended_type      is 'Extended            Type                ' ,
      reference_library  is 'Reference           Library             ' ,
      reference_file     is 'Reference           File                ' ,
      reference_field    is 'Reference           Field               ' ,
      creation_timestamp is 'Creation            Timestamp           ' ,
      creation_user      is 'Creation            User                ' ,
      creation_job       is 'Creation            Job                 ' ,
      creation_program   is 'Creation            Program             ' );

  Exec SQL
    Label on Column APLLIB.SCRLOC
     (ACTIVE_ROW          text is 'Active Row' ,
      screen_location_id  text is 'Screen Location Id' ,
      library_name        text is 'Library Name' ,
      file_name           text is 'File Name' ,
      member_name         text is 'Member Name' ,
      record_format       text is 'Record Format' ,
      record_format_type  text is 'Record Format Type' ,
      field_name          text is 'Field Name' ,
      field_column        text is 'Field Column' ,
      field_row           text is 'Field Row' ,
      field_length        text is 'Field Length' ,
      field_scale         text is 'Field Scale' ,
      file_type           text is 'File Type' ,
      extended_type       text is 'Extended Type' ,
      reference_library   text is 'Reference Library' ,
      reference_file      text is 'Reference File' ,
      reference_field     text is 'Reference Field',
      creation_timestamp  text is 'Creation Timestamp' ,
      creation_user       text is 'Creation User' ,
      creation_job        text is 'Creation Job' ,
      creation_program    text is 'Creation Program' );

  Exec SQL Create Index APLLIB/SCRLOCMBR on SCRLOC(MBR,RCDFMT,RCDFMTTYP,FLDNME);
  Exec SQL Label on Index APLLIB/SCRLOCMBR is 'Screen Location of Fields by Member';

End-Proc;
