PGM (&OUTQ)
  DCL &OUTQ *CHAR 20
  DCL &NME  *CHAR 10 STG(*DEFINED) DEFVAR(&OUTQ 1)
  DCL &LIB  *CHAR 10 STG(*DEFINED) DEFVAR(&OUTQ 11)

             ?CHGOUTQ    OUTQ(&LIB/&NME)

ENDPGM
