**Free
Dcl-Pr DCTFLDB0 ExtPgm;
  pmrDctMstIdn Like(APLDCT.DctMstIdn);
  pmrDctFldIdn Like(APLDCT.DctFldIdn);
  pmrOption Like(APLDCT.Option);
  pmrKeyPressed  Like(keyPressed);
End-Pr;
