**Free
Dcl-Pr DCTFLDD2 ExtPgm;
    DctFldIdn Like(APLDCT.DctFldIdn);
    DctMstIdn Like(APLDCT.DctMstIdn);
    Option Like(APLDCT.Option);
    KeyPressed Like(keyPressed);
End-Pr;
