**Free
Dcl-Pr DCTFLDD3 ExtPgm;
  pmrDctNme Like(APLDCT.DctNme);
  pmrFldNme Like(APLDCT.FldNme);
  pmrColTxt Like(APLDCT.ColTxt);
  pmrColHdg Like(APLDCT.ColHdg);
  pmrKeyPressed Like(keyPressed);
End-Pr;

