**Free
Dcl-Pr DCTMSTBP ExtPgm;
  pmrDctNme Like(APLDCT.DctNme) Options(*nopass);
  pmrDes Like(APLDCT.Des) Options(*nopass);
  pmrKeyPressed Like(keyPressed) Options(*nopass);
End-Pr;
