**Free
Dcl-Pr DCTSEGBP ExtPgm('DCTSEGBP');
  pmrDtaSeg Like(APLDCT.DtaSeg) Options(*nopass);
  pmrKeyPressed Like(keyPressed) Options(*nopass);
End-Pr;
