**Free
Dcl-Pr DCTSEGD2 ExtPgm('DCTSEGD2');
  pmr1DtaSeg Like(APLDCT.dtaSeg);
  pmrOption Like(APLDCT.Option);
  pmrKeyPressed Like(keyPressed);
End-Pr;
