**Free
Dcl-Pr DCTVALD2 ExtPgm('DCTVALD2');
  pmrDctNme  Like(APLDCT.DctNme);
  pmrFldNme  Like(APLDCT.FldNme);
  pmr1EnmVal Like(APLDCT.EnmVal);
  pmrOption  Like(APLDCT.Option);
  pmrKeyPressed Like(keyPressed);
End-Pr;
