PGM (&LIB &FILE &EXISTS &OBJTYP)
  DCL &FILE *CHAR 10
  DCL &LIB  *CHAR 10
  DCL &EXISTS  *CHAR 1
  DCL &OBJTYP  *CHAR 10

  CHGVAR &EXISTS 'Y'
  RTVOBJD    OBJ(&LIB/&FILE) OBJTYPE(*FILE) RTNLIB(&LIB) OBJATR(&OBJTYP)
  MONMSG CPF0000 EXEC(CHGVAR &EXISTS 'N')

ENDPGM
