PGM (&FRMOUTQ &TOOUTQ)
  DCL &FRMOUTQ *CHAR 20
  DCL &FRMNME  *CHAR 10 STG(*DEFINED) DEFVAR(&FRMOUTQ 1)
  DCL &FRMLIB  *CHAR 10 STG(*DEFINED) DEFVAR(&FRMOUTQ 11)
  DCL &TOOUTQ  *CHAR 20
  DCL &TONME   *CHAR 10 STG(*DEFINED) DEFVAR(&TOOUTQ 1)
  DCL &TOLIB   *CHAR 10 STG(*DEFINED) DEFVAR(&TOOUTQ 11)

             CRTDUPOBJ  OBJ(&FRMNME) FROMLIB(&FRMLIB) OBJTYPE(*OUTQ) +
                          TOLIB(&TOLIB) NEWOBJ(&TONME)
             ?CHGOUTQ    OUTQ(&TOLIB/&TONME)

ENDPGM
