**Free
Dcl-Pr FLDNTED1 ExtPgm('FLDNTED1');
  pmrFleLib Like(APLDCT.fleLib);
  pmrFleNme Like(APLDCT.fleNme);
  pmrFldNme Like(APLDCT.fldNme);
  pmrOption Like(APLDCT.Option);
  pmrKeyPressed Like(keyPressed);
End-Pr;

