**Free
Dcl-Pr FLDTYPB0 ExtPgm('FLDTYPB0');
  pmrFldTyp Like(APLDCT.FldTyp);
  pmrOption Like(APLDCT.Option);
  pmrKeyPressed  Like(keyPressed);
End-Pr;
