**free
Dcl-Pr FLDTYPD1 ExtPgm('FLDTYPD1');
  pmrFldTyp Like(APLDCT.FldTyp);
  pmrOption Like(APLDCT.Option);
  pmrKeyPressed Like(keyPressed);
  pmrSchVal like(APLDCT.schVal) options(*nopass);
End-Pr;
