**Free
Dcl-Pr FLEERRB0 ExtPgm('FLEERRB0');
  pmrFleErrIdn Like(APLDCT.FleErrIdn);
  pmrSel Like(APLDCT.Option) Const;
  pmrKeyPressed Like(keyPressed);
End-Pr;
