**FREE
Dcl-Pr FLEFLDB9 ExtPgm('FLEFLDB9');
  fleLib Like(apldct.fleLib) Const;
  fleNme Like(apldct.fleNme) Const;
  fldNme Like(apldct.fldNme) Const;
End-Pr;
