**Free
Dcl-Pr FLEFLDD2 ExtPgm('FLEFLDD2');
  FleLib Like(APLDCT.FleLib);
  FleNme Like(APLDCT.FleNme);
  FldNme Like(APLDCT.FldNme);
  Option Like(APLDCT.Option);
  KeyPressed Like(keyPressed);
End-Pr;
