**Free
Dcl-Pr FLEFLDB0 ExtPgm('FLEFLDB0');
  pmrFleLib Like(APLDCT.fleLib);
  pmrFleNme Like(APLDCT.fleNme);
  pmrFldNme Like(APLDCT.FldNme);
  pmrOption Like(APLDCT.Option);
  pmrKeyPressed  Like(keyPressed);
End-Pr;
