**Free
Dcl-Pr FLEIDXB0 ExtPgm('FLEIDXB0');
  pmrFleLib Like(APLDCT.fleLib);
  pmrFleNme Like(APLDCT.fleNme);
  pmrIdxLib Like(APLDCT.idxLib);
  pmrIdxNme Like(APLDCT.idxNme);
  pmrOption Like(APLDCT.Option);
  pmrKeyPressed  Like(keyPressed);
End-Pr;
