**Free
Dcl-Pr FLELOGD1 ExtPgm('FLELOGD1');
  pmrFleLib Like(APLDCT.FleLib);
  pmrFleNme Like(APLDCT.FleNme);
  pmrFldNme like(APLDCT.fldNme) options(*nopass);
End-Pr;
