**Free
Dcl-Pr FLELOGB0 ExtPgm('FLELOGB0');
  pmrFleLogIdn Like(APLDCT.FleLogIdn);
  pmrSel Like(APLDCT.Option) Const;
  pmrKeyPressed Like(keyPressed);
End-Pr;
