**Free
Dcl-Pr FLEMSTD1 ExtPgm('FLEMSTD1');
  pmrFleLib Like(APLDCT.FleLib);
  pmrFleNme Like(APLDCT.FleNme);
  pmrOption Like(APLDCT.Option) Const;
  pmrKeyPressed Like(keyPressed);
  pmrSchVal like(APLDCT.schVal) options(*nopass);
End-Pr;
