**Free
Dcl-Pr FLEMSTD3 ExtPgm('FLEMSTD3');
  pmr1fleLib Like(APLDCT.fleLib);
  pmr1fleNme Like(APLDCT.fleNme);
  pmrCpyLib Like(APLDCT.FleLib);
  pmrCpyNme Like(APLDCT.FleNme);
  pmrOption Like(APLDCT.Option);
  pmrKeyPressed Like(keyPressed);
End-Pr;
