**Free
Dcl-Pr FLEMSTB1 ExtPgm('FLEMSTB1');
  pmrFleLib Like(APLDCT.FleLib);
  pmrFleNme Like(APLDCT.FleNme);
  pmrKeyPressed Like(keyPressed);
End-Pr;
