**free
Dcl-Pr FLEMSTB9 extPgm('FLEMSTB9');
  pmrFleLib like(APLDCT.FLELIB) Const;
  pmrFleNme like(APLDCT.FLENME) Const;
  pmrSrcLib like(APLDCT.SRCLIB) Const;
  pmrSrcFle like(APLDCT.SRCFLE) Const;
  pmrObjLib like(APLDCT.OBJLIB) Const options(*nopass);
End-Pr;

