**Free
Dcl-Pr FLEMSTD2 ExtPgm('FLEMSTD2');
  pmr1fleLib Like(APLDCT.fleLib);
  pmr1fleNme Like(APLDCT.fleNme);
  pmrOption Like(APLDCT.Option);
  pmrKeyPressed Like(keyPressed);
End-Pr;
