**Free
Dcl-Pr FLEMSTD4 ExtPgm('FLEMSTD4');
  pmr1fleLib Like(APLDCT.fleLib);
  pmr1fleNme Like(APLDCT.fleNme);
  pmrKeyPressed Like(keyPressed);
End-Pr;
