**Free
Dcl-Pr FLENTED1 ExtPgm('FLENTED1');
  pmrFleLib Like(APLDCT.fleLib);
  pmrFleNme Like(APLDCT.fleNme);
  pmrOption Like(APLDCT.Option);
  pmrKeyPressed Like(keyPressed);
End-Pr;

