**Free
Dcl-Pr HLPDTLD1 ExtPgm('HLPDTLD1');
  pmrDctNme Like(APLDCT.dctNme);
  pmrFldNme Like(APLDCT.fldNme);
  pmrDspFle Like(APLDCT.dspFle);
  pmrVal    Like(APLDCT.val   );
  pmrOption Like(APLDCT.Option);
  pmrKeyPressed Like(keyPressed);
End-Pr;

