**Free
Dcl-Pr HLPMSTD1 ExtPgm('HLPMSTD1');
  pmrDctNme Like(APLDCT.DctNme);
  pmrFldNme Like(APLDCT.FldNme);
  pmrDspFle Like(APLDCT.DspFle);
  pmrVal Like(APLDCT.Val);
  pmrOption Like(APLDCT.Option);
  pmrKeyPressed Like(keyPressed);
End-Pr;
