**Free
Dcl-Pr HLPMSTB1 ExtPgm('HLPMSTB1');
  pmrSourceLibrary Char(10) Options(*nopass);
  pmrSourceFile Char(10) Options(*nopass);
  pmrSourceMember Char(10) Options(*nopass);
End-Pr;
