**Free
Dcl-Pr HLPMSTB2 ExtPgm('HLPMSTB2');
  pmrSourceLibrary Char(10) Options(*nopass);
  pmrSourceFile Char(10) Options(*nopass);
  pmrSourceMember Char(10) Options(*nopass);
End-Pr;
