**Free
// Display help text for HLPMST record
Dcl-Pr HLPMSTB4 ExtPgm('HLPMSTB4');
  pmrDctNme Like(APLDCT.dctNme);
  pmrFldNme Like(APLDCT.fldNme);
  pmrDspFle Like(APLDCT.dspFle);
  pmrVal    Like(APLDCT.val);
End-Pr;
