**FREE
Dcl-Pr MSGDTLD1 ExtPgm('MSGDTLD1');
  pmrMsfLib Like(APLDCT.MsfLib);
  pmrMsfNme Like(APLDCT.MsfNme);
  pmrMsgIdn Like(APLDCT.MsgIdn);
  pmrOption Like(APLDCT.Option);
  pmrKeyPressed Like(keyPressed);
End-Pr;
