**FREE
Dcl-Pr MSGMSTD1 ExtPgm('MSGMSTD1');
  pmrMsfLib Like(APLDCT.MsfLib);
  pmrMsfNme Like(APLDCT.MsfNme);
  pmrOption Like(APLDCT.Option);
  pmrKeyPressed Like(keyPressed);
End-Pr;
