**Free
Dcl-Pr OTQMSTB0 ExtPgm('OTQMSTB0');
  pmrOTQMSTIdn Like(APLDCT.OTQMSTIdn);
  pmrSel Like(APLDCT.Option) Const;
  pmrKeyPressed Like(keyPressed);
End-Pr;
