**Free
Dcl-Pr OTQMSTBP ExtPgm('OTQMSTBP');
  pmrOtqNme Like(APLDCT.OtqNme) Options(*nopass);
  pmrKeyPressed Like(keyPressed) Options(*nopass);
End-Pr;
