**Free
Dcl-Pr OTQMSTD2 ExtPgm('OTQMSTD2');
  pmr1OTQMSTIdn Like(APLDCT.OTQMSTIdn);
  pmrOption Like(APLDCT.Option);
  pmrKeyPressed Like(keyPressed);
End-Pr;
