**Free
Dcl-Pr PGMACTDP ExtPgm('PGMACTDP');
  pmrPgmNme     Like(APLDCT.pgmNme);
  pmrActCde     Like(APLDCT.actCde);
  pmrKeyPressed Like(keyPressed);
End-Pr;
