**Free
Dcl-Pr PGMACTD1 ExtPgm('PGMACTD1');
  pmrPgmNme     Like(APLDCT.pgmNme);
  pmrActCde     Like(APLDCT.actCde);
  pmrOption2    Like(APLDCT.Option);
  pmrKeyPressed Like(keyPressed);
End-Pr;
