**Free
Dcl-Pr PGMACTD2 ExtPgm('PGMACTD2');
  pmrPgmNme     Like(APLDCT.pgmNme);
  pmrActCde     Like(APLDCT.actCde);
  pmrOption     Like(APLDCT.option);
  pmrKeyPressed Like(keyPressed);
End-Pr;
