**Free
Dcl-Pr PGMACTBP ExtPgm('PGMACTBP');
  pmrPgmNme     Like(APLDCT.pgmNme);
  pmrActCde     Like(APLDCT.actCde);
  pmrKeyPressed Like(keyPressed);
End-Pr;
