**Free
Dcl-Pr PGMACTB0 ExtPgm('PGMACTB0');
  pmrPgmNme     Like(APLDCT.pgmNme);
  pmrActCde     Like(APLDCT.actCde);
  pmrOption     Like(APLDCT.Option);
  pmrKeyPressed Like(keyPressed);
End-Pr;
