**Free
Dcl-Pr PGMFNCB0 ExtPgm('PGMFNCB0');
  pmrPgmNme Like(APLDCT.pgmNme);
  pmrFncKey Like(APLDCT.fncKey);
  pmrOption Like(APLDCT.option);
  pmrOption2 Like(APLDCT.Option);
  pmrKeyPressed  Like(keyPressed);
End-Pr;
